{
  "Image": "hero_huskar",
  "Id": 59,
  "Name": "Huskar",
  "Fraction": "Radiant",
  "PrimaryAttribute": "Strength",
  "Bio": "Emerging from the throes of the sacred Nothl Realm, Huskar opened his eyes to see the prodigal shadow priest Dazzle working a deep incantation over him. Against the ancient rites of the Dezun Order, Huskar’s spirit had been saved from eternity, but like all who encounter the Nothl he found himself irrevocably changed. No longer at the mercy of a mortal body, his very lifeblood became a source of incredible power; every drop spilled was returned tenfold with a fierce, burning energy. However this newfound gift infuriated Huskar, for in his rescue from the Nothl, Dazzle had denied him a place among the gods. He had been denied his own holy sacrifice. In time the elders of the order sought to expand their influence and Huskar, they agreed, would be a formidable tool in their campaign. Yet becoming a mere weapon for the order that denied him his birthright only upset him further. As the first embers of war appeared on the horizon, he fled his ancestral home to find new allies, all the while seeking a cause worthy of unleashing the power his total sacrifice could bring.",
  "StrengthIni": 21,
  "AgilityIni": 15,
  "IntelligenceIni": 18,
  "StrengthGain": 2.7,
  "AgilityGain": 1.4,
  "IntelligenceGain": 1.5,
  "Speed": 300,
  "AttackMinIni": 21,
  "AttackMaxIni": 30,
  "DefenseIni": -1,
  "TurnRate": 0.5,
  "AttackRange": 400,
  "BAT": 1.6,
  "Abilities" : [
    {
      "id": 5271,
      "dname": "Inner Vitality",
      "affects": "ABILITY: <span >Unit Target</span><br />AFFECTS: <span >Allied Heroes</span><br />",
      "desc": 	"Unlocks the regenerative power of a friendly unit, with healing based upon its primary attribute. If the target is below 35%, it will heal faster.  Lasts 16 seconds.",
      "notes": 	"The HP percentage is checked every second and the regeneration adjusted accordingly.<br />Can be cast on Spell Immune units.",
      "dmg": "",
      "attribute": "HEALTH REGEN: <span >10</span><br />\nBONUS FROM ATTRIBUTE: <span >5% / 10% / 15% / 20%</span><br />\nBONUS WHEN HURT: <span >20% / 40% / 60% / 80%</span><br/>",
      "cmb": "<img src=\"mana\"/> 170  &emsp <img src=\"cooldown\"/> 22/18/14/10",
      "lore": "While Huskar has little use for magic, this minor enchantment was learned from the Dazzle and the Dezun priests, to be used in times of great injury.",
      "image": "skill_5271",
      "mainSkill": 1
    },
    {
      "id": 5272,
      "dname": "Burning Spear",
      "affects": "ABILITY: <span >Auto-Cast, Unit Target</span><br />AFFECTS: <span >Enemy Units</span><br />DAMAGE TYPE: <span >Magical</span><br />PIERCES SPELL IMMUNITY: <span >No</span><br />",
      "desc": "Huskar sets his spears aflame, dealing damage over time with his regular attack.  Multiple attacks will stack additional damage.  Each attack drains some of Huskar's health.  Lasts 8 seconds.",
      "notes": "Burning Spears stacks additively when used multiple times on one target.  There is no cap.<br />Huskar cannot kill himself with this skill.",
      "dmg": "DAMAGE: <span >5 / 10 / 15 / 20</span><br />",
      "attribute": "HEALTH COST: <span >15</span><br/>",
      "cmb": "<img src=\"mana\" /> 0 &emsp <img src=\"cooldown\"/> 0",
      "lore": "The Sacred Warrior ignites his weaponry after marking it with his own blood - causing far greater pain than he himself feels.",
      "image": "skill_5272",
      "mainSkill": 1
    },
    {
      "id": 5273,
      "dname": "Berserker's Blood",
      "affects": "ABILITY: <span >Passive</span><br />",
      "desc": "Huskar's injuries feed his power, giving increased attack speed and magic damage resistance based on missing health.",
      "notes": 	"Maximum bonus is achieved when Huskar has strictly less than 10% of his maximum HP.<br />Bonuses are provided linearly, no bonus at 100% HP and full bonus at 10% HP.",
      "dmg": "",
      "attribute": 	"MAX ATTACK SPEED: <span >220 / 260 / 300 / 340</span><br />\nMAX MAGIC RESISTANCE: <span >20% / 30% / 40% / 50%</span><br />\nHP FOR MAX BONUS: <span >10%</span><br/>",
      "cmb": "",
      "lore": 	"After losing his birthright, Huskar gained a lethality in physical combat that is only heightened as his own blood is spilled.",
      "image": "skill_5273",
      "mainSkill": 1
    },
    {
      "id": 5274,
      "dname": 	"Life Break",
      "affects": 	"ABILITY: <span >Unit Target</span><br />AFFECTS: <span >Enemy Units</span><br />DAMAGE TYPE: <span >Magical</span><br />PIERCES SPELL IMMUNITY: <span ><font color=\"#70EA72\">Yes</font></span><br />",
      "desc": 	"Huskar draws upon his health to break an enemy's life, leaping at a target within attack range to shatter a percentage of that hero's current health, and slowing them.  While leaping, Huskar is Spell Immune.\nUpgradable by Aghanim's Scepter.",
      "notes": "If Huskar is disabled during the charge or the target moves more than 1400 units in 0.015 seconds, the charge stops.<br />Slow works on Spell Immune units.<br />Life Break cannot be disjointed.",
      "dmg": 	"",
      "attribute": "DAMAGE DEALT: <span >34% / 38% / 42%</span><br />\nMOVEMENT SLOW: <span >40% / 50% / 60%</span><br />\nSLOW DURATION: <span >4 / 5 / 6</span><br />\n<font size=\"3\" color=\"#6fe871\">SCEPTER DAMAGE DEALT:</font> <span >65%</span><br />\n<font size=\"3\" color=\"#6fe871\">SCEPTER COOLDOWN:</font> <span >4</span><br/>",
      "lore": "Tectonic plates crack, mountains fold, and foes are crushed by the Echo Slam.",
      "cmb": "<img src=\"mana\"/> 0 &emsp <img src=\"cooldown\"/> 12",
      "image": "skill_5274",
      "mainSkill": 1
    }
  ]
}