{
  "Image": "hero_sniper",
  "Id": 35,
  "Name": "Sniper",
  "Fraction": "Radiant",
  "PrimaryAttribute": "Agility",
  "Bio": "Kardel Sharpeye was born deep in the mountainous valleys of Knollen where, since time immemorial, the folk have survived by hunting the strange, cliff-dwelling steepstalkers above their village—killing them from a distance and collecting their carcasses where they fell. Sharpeye was among the best of these strange folk for whom projectile weapons are but another appendage, and to shoot is as natural as to touch. \n \n On his day of summoning, when he was to gain full standing in his village, Sharpeye took the ancient test: a single shot from the valley floor to strike a beast down from the cliffs. To miss was to be dishonored. With his entire village standing vigil, Sharpeye took his shot. A steepstalker fell; the crowd cheered. But when the carcass was collected, the village grew silent, for the elders found that the bullet had pierced its glittering central eye then fallen to be clenched in the steepstalker's mandibles. This ominous sign was the literal opening of a dark prophecy, foretelling both greatness and exile for the gunman who made such a shot. Sharpeye the Sniper was thus, by his own skill, condemned to make his way apart from his people—and unwelcome back among them until he has fulfilled the remainder of the prophecy by attaining legendary stature on a field of battle.",
  "StrengthIni": 16,
  "AgilityIni": 21,
  "IntelligenceIni": 15,
  "StrengthGain": 2,
  "AgilityGain": 2.5,
  "IntelligenceGain": 2.6,
  "Speed": 290,
  "AttackMinIni": 15,
  "AttackMaxIni": 21,
  "DefenseIni": -1,
  "TurnRate": 0.7,
  "AttackRange": 550,
  "BAT": 1.7,
  "Abilities" : [
    {
      "id": 5154,
      "dname": "Shrapnel",
      "affects": "ABILITY: <span >Point Target</span><br />DAMAGE TYPE: <span >Magical</span><br />PIERCES SPELL IMMUNITY: <span >No</span><br />",
      "desc": "Consumes a charge to launch a ball of shrapnel that showers the target area in explosive pellets. Enemies are subject to damage and slowed movement. Reveals the targeted area. Shrapnel charges restore every 55 seconds.",
      "notes": "Damage is dealt 11 times, immediately at spell effect then every second.<br />Does not damage buildings.<br />Provides vision in the targeted area.",
      "dmg": "",
      "attribute": "MOVEMENT SLOW: <span >15% / 20% / 25% / 30%</span><br />\nRADIUS: <span >450</span><br />\nDURATION: <span >10</span><br/>",
      "cmb": "<img src=\"mana\"/> 50",
      "lore": "Kardel's modular rifle also fires incendiary rounds, useful for assaulting entrenched locations.",
      "image": "skill_5154",
      "mainSkill": 1
    },
    {
      "id": 5155,
      "dname": 	"Headshot",
      "affects": "ABILITY: <span >Passive</span><br />DAMAGE TYPE: <span ><font color=\"#71a9ea\">Physical</font></span><br />PIERCES SPELL IMMUNITY: <span >No</span><br />",
      "desc": "Sniper increases his accuracy, giving him a chance to deal extra damage and briefly stop the movements of his enemies.",
      "notes": 	"Works on allied creeps.",
      "dmg": "DAMAGE: <span >15 / 40 / 65 / 90</span><br />",
      "attribute": 	"CHANCE: <span >40%</span><br/>",
      "cmb": "",
      "lore": "Taking potshots at steepstalkers in his childhood has been thoroughly refined into perfect leads on enemy combatants.",
      "image": "skill_5155",
      "mainSkill": 1
    },
    {
      "id": 5156,
      "dname": "Take Aim",
      "affects": "ABILITY: <span >Passive</span><br />",
      "desc": "Extends the attack range of Sniper's rifle.",
      "notes": "",
      "dmg": "",
      "attribute": "BONUS RANGE: <span >100 / 200 / 300 / 400</span><br/>",
      "cmb": "",
      "lore": "Kardel always takes it upon himself to stay as far from harm as he can while still performing his role - taking perfect aim.",
      "image": "skill_5156",
      "mainSkill": 1
    },
    {
      "id": 5157,
      "dname": 	"Assassinate",
      "affects": "ABILITY: <span >Unit Target</span><br />AFFECTS: <span >Enemy Units</span><br />DAMAGE TYPE: <span >Magical</span><br />PIERCES SPELL IMMUNITY: <span ><font color=\"#70EA72\">Yes</font></span><br />",
      "desc": "Sniper locks onto a target enemy unit and, after 2 seconds, fires a devastating shot that deals damage at long range, and mini-stuns the target.\nUpgradable by Aghanim's Scepter.",
      "notes": 	"Crosshair effect is only visible to allies.<br />Invisibility doesn't disjoint the projectile.<br />Interrupts channeling spell, including on Spell Immune units.",
      "dmg": 	"DAMAGE: <span >320 / 485 / 650</span><br />",
      "attribute": 	"RANGE: <span >2000 / 2500 / 3000</span><br />\nSCEPTER RADIUS: <span >400</span><br />\n<font size=\"3\" color=\"#6fe871\">SCEPTER CRITICAL DAMAGE:</font> <span >280%</span><br/>",
      "cmb": "<img src=\"mana\"/> 175/275/375 &emsp <img src=\"cooldown\"/> 20/15/10",
      "lore": "In order to fulfill the prophecy and return to his home town, Kardel must make another shot as perfect as the one on the day of his ancient test.",
      "image": "skill_5157",
      "mainSkill": 1
    }
  ]
}