{
  "Image": "hero_medusa",
  "Id": 94,
  "Name": "Medusa",
  "Fraction": "Dire",
  "PrimaryAttribute": "Agility",
  "Bio": "Beauty is power. This thought comforted Medusa--the youngest and loveliest of three beautiful Gorgon sisters, born to a sea goddess--because she alone of the sisters was mortal. It comforted her, that is, until the day masked assailants invaded the Gorgon realm and tore the two immortal sisters from their home, unmoved by their beauty or by their tears. One of the invaders seized Medusa as well, but then cast her aside with a disgusted look: 'This one has the mortal stink upon her. We have no use for that which dies.' Humiliated, enraged, Medusa fled to the temple of her mother and cast herself before the goddess, crying, 'You denied me eternal life--therefore I beg you, give me power! Power, so I can dedicate what life I have to rescuing my sisters and avenging this injustice!' After long thought, the goddess granted her daughter's request, allowing Medusa to trade her legendary beauty for a face and form of terrifying strength. Never for a moment has Medusa regretted her choice. She understands that power is the only beauty worth possessing--for only power can change the world.",
  "StrengthIni": 14,
  "AgilityIni": 20,
  "IntelligenceIni": 19,
  "StrengthGain": 1.95,
  "AgilityGain": 2.5,
  "IntelligenceGain": 2.1,
  "Speed": 290,
  "AttackMinIni": 24,
  "AttackMaxIni": 30,
  "DefenseIni": -1,
  "TurnRate": 0.5,
  "AttackRange": 600,
  "BAT": 1.7,
  "Abilities" : [
    {
      "id": 5504,
      "dname": "Split Shot",
      "affects": "ABILITY: <span>No Target, Toggle</span><br />PIERCES SPELL IMMUNITY: <span><font color=\"#70EA72\">Yes</font></span><br />",
      "desc": "Medusa magically splits her shot into several arrows. These arrows deal a lower percent of her normal damage.\r\n\r\nThe extra targets will not receive other attack effects (such as critical strike) and Unique Attack Modifiers.",
      "notes": "Secondary targets will be the closest enemy units excluding the primary target.<br />If illusions of Medusa are created while Split Shot is active, they will also have this ability.",
      "dmg": "",
      "attribute": "OUTGOING DAMAGE: <span>80%</span><br />\nRANGE: <span>700</span><br/>BONUS ATTACK TARGETS: 1/2/3/4 <br/>",
      "cmb": "<img src=\"mana\"/> 125/140/155/170  &emsp <img src=\"cooldown\"/> 15",
      "lore": "All who encounter the cursed Gorgon will feel her rage.",
      "image": "skill_5504",
      "mainSkill": 1
    },
    {
      "id": 5505,
      "dname": "Mystic Snake",
      "affects": "ABILITY: <span>Unit Target</span><br />AFFECTS: <span>Enemy Units</span><br />DAMAGE TYPE: <span>Magical</span><br />PIERCES SPELL IMMUNITY: <span>No</span><br />",
      "desc": "A mystic snake made of energy jumps from target to target dealing damage and stealing mana. After it reaches its last target, it returns to Medusa to replenish her with mana. The snake deals more damage per jump and steals 11% of the targets' total mana. Deals Pure damage to units petrified by Stone Gaze.\nUpgradable by Aghanim's Scepter.",
      "notes": "Mystic Snake cannot be disjointed.",
      "dmg": "",
      "attribute": "JUMP RADIUS: <span>475 / 475 / 475 / 475</span><br />\nJUMPS: <span>3 / 4 / 5 / 6</span><br />\nDAMAGE: <span>80 / 120 / 160 / 200</span><br />\nMANA STEAL: <span>11% / 14% / 17% / 20%</span><br />\nDAMAGE INCREASE PER JUMP: <span>35%</span><br />\n<font size=\"3\" color=\"#6fe871\">SCEPTER BASE DURATION:</font> <span>1</span><br />\n<font size=\"3\" color=\"#6fe871\">SCEPTER DURATION BOUNCE INCREASE:</font> <span>0.3</span><br/>",
      "cmb": "<img src=\"mana\" /> 140/150/160/170 &emsp <img src=\"cooldown\"/> 11",
      "lore": "The Gorgon's curse is her greatest strength.",
      "image": "skill_5505",
      "mainSkill": 1
    },
    {
      "id": 5506,
      "dname": "Mana Shield",
      "affects": "ABILITY: <span>No Target, Toggle</span><br />",
      "desc": "Creates a shield that absorbs 60% of the incoming damage in exchange for Medusa's mana.",
      "notes": "Absorbs damage before any damage reduction takes place, meaning that armor will not reduce the amount of mana needed to absorb damage.",
      "dmg": "",
      "attribute": "DAMAGE PER MANA: <span>1.6 / 1.9 / 2.2 / 2.5</span><br/>",
      "cmb": "",
      "lore": "While Medusa was not gifted with eternal life upon birth, her curse bestowed her with impressive defensive powers.",
      "image": "skil_5506",
      "mainSkill": 1
    },
    {
      "id": 5507,
      "dname": "Stone Gaze",
      "affects": "ABILITY: <span>No Target</span><br />DAMAGE TYPE: <span>Magical</span><br />PIERCES SPELL IMMUNITY: <span><font color=\"#70EA72\">Yes</font></span><br />",
      "desc": "Any enemy units looking at Medusa will have their movement and attack speed slowed.  If 2 seconds of total time is accumulated looking at Medusa while Stone Gaze is active, that unit will turn to stone.  Petrified units are stunned, have 100% magic damage resistance, and take bonus physical damage.  If the petrified unit is an illusion, it is immediately killed.",
      "notes": "Affects Spell Immune units.<br />Regardless of when a unit receives the Stone Gaze buff while the ability is active on Medusa, it will still receive the full debuff duration.",
      "dmg": "",
      "attribute": "RADIUS: <span>1000 / 1000 / 1000</span><br />\nDURATION: <span>5 / 6 / 7</span><br />\nSLOW: <span>35%</span><br />\nBONUS PHYSICAL DAMAGE: <span>50%</span><br/>",
      "cmb": "<img src=\"mana\"/> 200 &emsp <img src=\"cooldown\"/> 90",
      "lore": "The beauty of Medusa is legendary.",
      "image": "skill_5507",
      "mainSkill": 1
    }
  ]
}