{
  "Image": "hero_gyrocopter",
  "Id": 72,
  "Name": "Gyrocopter",
  "Fraction": "Radiant",
  "PrimaryAttribute": "Agility",
  "Bio": "After serving through a lifetime of wars, upheaval, riots, and revolutions, the brass figured Aurel had seen enough. But in addition to a few trinkets and his considerable pension, the erstwhile engineer left with something far more interesting: a long-forgotten, incomplete schematic for a Gyrocopter, the world’s first manned, non-magical flying device. Retiring to the tropical obscurity of the Ash Archipelago with little else but time and money, he set to work building the device. As the years wore on and the remains of failed prototypes began to pile up, he began to wonder if mechanical flight was even possible. A decade and a day after his retirement, on a sunny afternoon with a southerly breeze, Aurel sat in his latest attempt bristling with indignation and expectant failure. With a grunt of effort he pulled the ignition cord and covered his head, waiting for the inevitable explosion. However to his great surprise he began to lift and, following a few panicked adjustments, stabilize. Within an hour, he was ducking and weaving with the breeze, level with the gulls, and Aurel found himself filled with the breathless wonder of flight. As dusk settled in he set a course back to his workshop, but no sooner had he turned his craft when a cannonball tore through his tailfin. Disentangling himself from the wreckage, he swam toward the nearest piece of land in sight, and cursed to see the ship responsible for the cannonball collecting the debris. Days later, when Aurel returned to his workshop, he set to work on yet another gyrocopter, this one capable of carrying a much heavier, more dangerous payload.",
  "StrengthIni": 18,
  "AgilityIni": 24,
  "IntelligenceIni": 19,
  "StrengthGain": 2.1,
  "AgilityGain": 2.8,
  "IntelligenceGain": 2.1,
  "Speed": 325,
  "AttackMinIni": 13,
  "AttackMaxIni": 23,
  "DefenseIni": 1,
  "TurnRate": 0.6,
  "AttackRange": 365,
  "BAT": 1.7,
  "Abilities" : [
    {
      "id": 5361,
      "dname": "Rocket Barrage",
      "affects": "ABILITY: <span >No Target</span><br />DAMAGE TYPE: <span >Magical</span><br />PIERCES SPELL IMMUNITY: <span >No</span><br />",
      "desc": "Launches a salvo of rockets at nearby enemy units in a radius around the Gyrocopter.  Lasts 3 seconds.",
      "notes": "Rocket Barrage can't hit units Gyrocopter has no vision over.",
      "dmg": "DAMAGE: <span >7 / 12 / 17 / 22</span><br />",
      "attribute": "RADIUS: <span >400</span><br />\nROCKETS PER SECOND: <span >10</span><br/>",
      "cmb": "<img src=\"mana\"/> 90  &emsp <img src=\"cooldown\"/> 7/6.50/6/5.50",
      "lore": "Aurel's new craft has an increased payload for rockets, enhancing their rapid-fire capabilities.",
      "image": "skill_5361",
      "mainSkill": 1
    },
    {
      "id": 5362,
      "dname": "Homing Missile",
      "affects": "ABILITY: <span >Unit Target</span><br />AFFECTS: <span >Enemy Units</span><br />DAMAGE TYPE: <span >Magical</span><br />PIERCES SPELL IMMUNITY: <span >No</span><br />",
      "desc": "Fires a homing missile to seek the targeted enemy unit. The missile gains speed over time, dealing damage and stunning when it impacts the target.  Homing Missile deals greater damage the further it has traveled.  Enemy units can destroy the missile before it reaches its target.",
      "notes": "Towers do half damage to the missile.<br />The crosshair effect is visible to allies only.<br />Maximum damage is reached when the missile is 1500 units away.<br />The missile will follow and hit invisible units.",
      "dmg": "DAMAGE: <span >125 / 250 / 375 / 500</span><br />",
      "attribute": "HITS TO DESTROY: <span >3 / 3 / 4 / 5</span><br />\nTOWER HITS TO DESTROY: <span >6 / 6 / 8 / 10</span><br />\nSTUN DURATION: <span >2.25 / 2.5 / 2.75 / 3</span><br />\nMINIMUM DAMAGE: <span >50</span><br/>",
      "cmb": "<img src=\"mana\" /> 120/130/140/150 &emsp <img src=\"cooldown\"/> 20/17/14/11",
      "lore": "The biggest missile Aurel could possibly attach to his craft, The Bomb&trade; has carefully calculated aerodynamics and explosives for maximum impact.",
      "image": "skill_5362",
      "mainSkill": 1
    },
    {
      "id": "5363",
      "dname": 	"Flak Cannon",
      "affects": "ABILITY: <span >No Target</span><br />DAMAGE TYPE: <span ><font color=\"#71a9ea\">Physical</font></span><br />PIERCES SPELL IMMUNITY: <span ><font color=\"#70EA72\">Yes</font></span><br />",
      "desc": "Gyrocopter's attacks hit all enemy units in an area around it for a limited number of attacks.  Only the main target of attacks will receive attack bonuses such as Critical Strike.  Lasts 15 seconds or until the attacks are used.",
      "notes": "Attack range for the primary attack is unchanged.",
      "dmg": "",
      "attribute": "RADIUS: <span >1250</span><br/>",
      "cmb": "<img src=\"mana\" /> 50 &emsp <img src=\"cooldown\"/> 30",
      "lore": "This newly revamped Gyrocopter has attached enough armaments to assault in a 360 degree radius.",
      "image": "skill_5363",
      "mainSkill": 1
    },
    {
      "id": 5364,
      "dname": 	"Call Down",
      "affects": "ABILITY: <span >Point Target</span><br />DAMAGE TYPE: <span >Magical</span><br />PIERCES SPELL IMMUNITY: <span >No</span><br />",
      "desc": "Call down an aerial missile strike on enemy units in a target area.  Two missiles arrive in succession, the first dealing major damage and minor slow for 2 seconds; the second dealing minor damage and major slow for 4 seconds.\nUpgradable by Aghanim's Scepter.",
      "notes": "The visual indicator is visible to allies only.",
      "dmg": "",
      "attribute": "MISSILE ONE DAMAGE: <span >200 / 275 / 350</span><br />\nMISSILE TWO DAMAGE: <span >100 / 150 / 200</span><br />\nMISSILE ONE SLOW: <span >30%</span><br />\nMISSILE TWO SLOW: <span >60%</span><br />\nRADIUS: <span >600</span><br/><font size=\"3\" color=\"#6fe871\">SCEPTER UPGRADE:</font><span>Adds a Side Gunner that at random attacks enemy units within a 600 radius every 1.1 seconds.</span><br/>",
      "cmb": "<img src=\"mana\"/> 125 &emsp <img src=\"cooldown\"/> 55/50/45",
      "lore": "'Bombs Away!'",
      "image": "skill_5364",
      "mainSkill": 1
    }
  ]
}