{
  "Image": "hero_broodmother",
  "Id": 61,
  "Name": "Broodmother",
  "Fraction": "Dire",
  "PrimaryAttribute": "Agility",
  "Bio": "For centuries, Black Arachnia the Broodmother lurked in the dark lava tubes beneath the smoldering caldera of Mount Pyrotheos, raising millions of spiderlings in safety before sending them to find prey in the wide world above. In a later age, the Vizier of Greed, Ptholopthales, erected his lodestone ziggurat on the slopes of the dead volcano, knowing that any looters who sought his magnetic wealth must survive the spider-haunted passages. After millennia of maternal peace, Black Arachnia found herself beset by a steady trickle of furfeet and cutpurses, bold knights and noble youths--all of them delicious, certainly, and yet tending to create a less than nurturing environment for her innocent offspring. Tiring of the intrusions, she paid a visit to Ptholopthales; and when he proved unwilling to discuss a compromise, she wrapped the Vizier in silk and set him aside to be the centerpiece of a special birthday feast. Unfortunately, the absence of the Magnetic Ziggurat's master merely emboldened a new generation of intruders. When one of her newborns was trodden underfoot by a clumsy adventurer, she reached the end of her silken rope. Broodmother headed for the surface, declaring her intent to rid the world of each and every possible invader, down to the last Hero if necessary, until she could ensure her nursery might once more be a safe and wholesome environment for her precious spiderspawn.",
  "StrengthIni": 17,
  "AgilityIni": 18,
  "IntelligenceIni": 18,
  "StrengthGain": 2.8,
  "AgilityGain": 2.2,
  "IntelligenceGain": 2,
  "Speed": 295,
  "AttackMinIni": 26,
  "AttackMaxIni": 32,
  "DefenseIni": 0,
  "TurnRate": 0.5,
  "AttackRange": 150,
  "BAT": 1.7,
  "Abilities" : [
    {
      "id": 5279,
      "dname": "Spawn Spiderlings",
      "affects": "ABILITY: <span>Unit Target</span><br />AFFECTS: <span>Enemy Units</span><br />DAMAGE TYPE: <span>Magical</span><br />PIERCES SPELL IMMUNITY: <span>No</span><br />",
      "desc": "Broodmother injects her young into an enemy unit, dealing damage. The spiderlings will hatch if the target is killed while under this influence.",
      "notes": "If the target is killed within 2 seconds of being hit with this skill, the Spiderlings will spawn.<br />Units killed by Spiderlings will then give birth to Spiderites, smaller and less powerful versions of the Spiderlings.",
      "dmg": "DAMAGE: 70/140/210/280<br/> ",
      "attribute": "LIFETIME: <span>60 / 60 / 60 / 60</span><br />\nCOUNT: <span>1 / 2 / 3 / 4</span><br/>",
      "cmb": "<img src=\"mana\"/> 120  &emsp <img src=\"cooldown\"/> 10",
      "lore": "Black Arachnia continues to raise her young, even amidst the field of combat.  The brood quickly learns how to support their mother.",
      "image": "broodmother_spawn_spiderlings",
      "mainSkill": 1
    },
    {
      "id": 5280,
      "dname": "Spin Web",
      "affects": "ABILITY: <span>Point Target</span><br />",
      "desc": "Spins a large web that renders Broodmother invisible, grants a passive movement speed increase, gives free movement, and boosts regeneration while in its vicinity. Spin Web charges restore every 40 seconds. If damage is taken, free movement is disabled and the movement speed increase is halved for 6 seconds. Spin Web can be cast from anywhere as long as the new web touches an existing web. Webs never expire, and can be manually destroyed. When the maximum limit of webs is exceeded, the oldest web disappears.",
      "notes": "Has a fade time of 2 seconds.<br />Also affects Spiderling and Spiderites.<br />If free movement is disabled, you will destroy nearby trees.",
      "dmg": "",
      "attribute": "HEALTH REGEN: <span>3 / 5 / 7 / 9</span><br />\nMOVE INCREASE: <span>40% / 50% / 60% / 70%</span><br />\nMAX WEB CHARGES: <span>1 / 2 / 3 / 4</span><br />\nCHARGE RESTORE TIME: <span>40</span><br/>",
      "cmb": "<img src=\"mana\" />50 &emsp <img src=\"cooldown\"/> 0",
      "lore": "Weaving a bed of silken fibers, Arachnia's web both protects her and her offspring, as well as giving advancing opponents a sense of forboding.",
      "image": "broodmother_spin_web",
      "mainSkill": 1
    },
    {
      "id": 5281,
      "dname": "Incapacitating Bite",
      "affects": "ABILITY: <span>Passive</span><br />",
      "desc": "Broodmother's venom cripples enemy units, causing her attacks to slow and giving the affected unit a chance to miss its attacks.",
      "notes": "The miss chance stacks with evasion and terrain dodge chance.",
      "dmg": "",
      "attribute": "MISS CHANCE: <span>30% / 40% / 50% / 60%</span><br />\nMOVE SLOW: <span>16% / 26% / 36% / 46%</span><br />\nDURATION: <span>2 / 2 / 2 / 2</span><br/>",
      "cmb": "",
      "lore": "Paralytic toxins come from Black Arachnia's fangs, causing a slow and painful death to those who intrude on her webs.",
      "image": "broodmother_incapacitating_bite",
      "mainSkill": 1
    },
    {
      "id": 5282,
      "dname": "Insatiable Hunger",
      "affects": "ABILITY: <span>No Target</span><br />",
      "desc": "A violent lust for vital fluids increases Broodmother's attack damage and gives her a vampiric attack.",
      "notes": "Fully stacks with other sources of lifesteal.",
      "dmg": "",
      "attribute": "BONUS DAMAGE: <span>60 / 100 / 140</span><br />\nLIFESTEAL: <span>60% / 100% / 140%</span><br />\nDURATION: <span>14 / 14 / 14</span><br/>",
      "cmb": "<img src=\"mana\"/> 100 &emsp <img src=\"cooldown\"/> 45",
      "lore": "While most of her prey is wrapped in silken cocoons and saved for her young, the Broodmother herself has a taste for wandering heroes.",
      "image": "broodmother_insatiable_hunger",
      "mainSkill": 1
    }
  ]
}