{
  "Image": "hero_arc_warden",
  "Id": 113,
  "Name": "Arc Warden",
  "Fraction": "Dire",
  "PrimaryAttribute": "Agility",
  "Bio": "Before the beginning of all, there existed a presence: a primordial mind, infinite, awesome, and set to inscrutable purpose. As the universe thundered into being, this mind was fragmented and scattered. Two among its greater fragments--who would come to be named Radiant and Dire--found themselves locked in vicious opposition, and began twisting all of creation to serve their conflict.\n\nAs war and cataclysm threatened the nascent cosmos, the will of a third fragment made itself known. Naming itself Zet, this intellect sought to resolve the disharmony and return all to perfect unity. Appalled by its kin's conflicting nature, Zet gathered the sum of its power. In a sudden flash, it overwhelmed its siblings, and fused the warring aspects into a stellar sphere before hurling them into the darkness to orbit a nondescript world. Harmony was restored, though only the barest fraction of Zet's strength remained. Setting its gaze on the prison, Zet chose to use its weakened power to serve as watchful warden until time's end. For uncounted aeons, this vigil stood.\n\nLife flourished upon the world below, oblivious to the dangers imprisoned within the softly glowing moon, or of Zet's struggles to contain them. As the captives' eternal clash reverberated within, the surface of the prison shuddered, over time beginning to crack. Ultimately, Zet's depleted power proved insufficient to contain the breach, and at last the moon was shattered. The prison's ancient inhabitants had escaped to sow their conflict anew.\n\nFlung to the farthest reaches by the prison's explosion, Zet was transformed by the dissonant energies of its former captives. No longer of single form and thought, its presence had become split among many--some lesser, some greater--each connected by a fleeting arc of consciousness. Struggling to suppress its own disunity, Zet sped toward the burgeoning conflict of its siblings, bending its fractured wills toward a singular conclusion: the aspects of the primordial mind must be made to reunite, or all must be destroyed lest the conflict spread further…",
  "StrengthIni": 24,
  "AgilityIni": 15,
  "IntelligenceIni": 24,
  "StrengthGain": 3,
  "AgilityGain": 1.8,
  "IntelligenceGain": 2.6,
  "Speed": 285,
  "AttackMinIni": 29,
  "AttackMaxIni": 39,
  "DefenseIni": -2,
  "TurnRate": 0.6,
  "AttackRange": 625,
  "BAT": 1.7,
  "Abilities" : [
    {
      "id": 5677,
      "dname": "Flux",
      "affects": "ABILITY: <span>Unit Target</span><br />AFFECTS: <span>Enemy Units</span><br />DAMAGE TYPE: <span>Magical</span><br />PIERCES SPELL IMMUNITY: <span>No</span><br />",
      "desc": "Infuses a lone enemy unit with swirling, volatile energy, slowing its movement speed and dealing damage over time. The effect is muted if another enemy unit is near the target.",
      "notes": "",
      "dmg": "",
      "attribute": "DURATION: <span>6</span><br />\nDAMAGE PER SECOND: <span>15 / 30 / 45 / 60</span><br />\nALLY SEARCH RADIUS: <span>225</span><br />\nMOVEMENT SPEED SLOW: <span>20% / 30% / 40% / 50%</span><br />\nCAST RANGE: <span>600 / 700 / 800 / 900</span><br/>",
      "cmb": "<img src=\"mana\"/> 75  &emsp <img src=\"cooldown\"/> 18",
      "lore": "An infinitesimal fraction of the power which imprisoned the Ancients.",
      "image": "arc_warden_flux",
      "mainSkill": 1
    },
    {
      "id": 5678,
      "dname": "Magnetic Field",
      "affects": "ABILITY: <span>Point Target</span><br />PIERCES SPELL IMMUNITY: <span>No</span><br />",
      "desc": "Generates a circular distortion field of magnetic energy that protects allied heroes and buildings within it by evading attacks coming from outside the field.",
      "notes": "Bonus damage is based on base damage and that given by primary attribute.<br />Self-cast with Scepter will make it behave in the non-Scepter form, without jumping.<br />Enchant Totem has True Strike.",
      "dmg": "",
      "attribute": "RADIUS: <span>275</span><br />\nDURATION: <span>3.5 / 4.5 / 5.5 / 6.5</span><br />\nATTACK SPEED BONUS: <span>50 / 60 / 70 / 80</span><br />\nEVASION BONUS: <span>100%</span><br/>",
      "cmb": "<img src=\"mana\" /> 80/90/100/110 &emsp <img src=\"cooldown\"/> 35/30/25/20",
      "lore": "Time and space are of little consequence to one as old as Zet.",
      "image": "arc_warden_magnetic_field",
      "mainSkill": 1
    },
    {
      "id": 5679,
      "dname": "Spark Wraith",
      "affects": "ABILITY: <span>Point Target</span><br />DAMAGE TYPE: <span>Magical</span><br />PIERCES SPELL IMMUNITY: <span>No</span><br />",
      "desc": "Summons a Spark Wraith that slowly materializes and patrols a targeted area until an enemy comes within its range. Once a target has been found the wraith fuses with them, dealing magical damage and slowing the unit.",
      "notes": "",
      "dmg": "DAMAGE: 100/160/220/280 ",
      "attribute": "SEARCH RADIUS: <span>375</span><br />\nACTIVATION DELAY: <span>2</span><br />\nDURATION: <span>50</span><br />\nWRAITH SPEED: <span>400</span><br />\nPURGE DURATION: <span>0.4 / 0.5 / 0.6 / 0.7</span><br/>",
      "cmb": "<img src=\"mana\"/> 80  &emsp <img src=\"cooldown\"/> 4",
      "lore": "Lesser fragments of Zet's original self.",
      "image": "arc_warden_spark_wraith",
      "mainSkill": 1
    },
    {
      "id": 5683,
      "dname": "Tempest Double",
      "affects": "ABILITY: <span>No Target</span><br />",
      "desc": "Briefly refocusing its fractured elements into a single form, the Arc Warden is able to create a perfect electrical duplication of itself. The duplicate can use all of Arc Warden's current items and spells, except consumables and items that drop on death. The duplicate has seperate item and ability cooldowns.",
      "notes": "",
      "dmg": "",
      "attribute": "DURATION: <span>14 / 16 / 18</span><br/>",
      "cmb": "<img src=\"cooldown\"/> 60/50/40",
      "lore": "Warped by the power of its peers, Arc Warden becomes what it despises most: disharmony.",
      "image": "arc_warden_tempest_double",
      "mainSkill": 1
    }
  ]
}