{
  "Image": "hero_alchemist",
  "Id": 73,
  "Name": "Alchemist",
  "Fraction": "Radiant",
  "PrimaryAttribute": "Strength",
  "Bio": "The sacred science of Chymistry was a Darkbrew family tradition, but no Darkbrew had ever shown the kind of creativity, ambition, and recklessness of young Razzil. However, when adulthood came calling he pushed aside the family trade to try his hand at manufacturing gold through Alchemy. In an act of audacity befitting his reputation, Razzil announced he would transmute an entire mountain into gold. Following two decades of research and spending and preparation, he failed spectacularly, quickly finding himself imprisoned for the widespread destruction his experiment wrought. Yet Razzil was never one to take a setback lightly, and sought escape to continue his research. When his new cellmate turned out to be a fierce ogre, he found just the opportunity he needed. After convincing the ogre not to eat him, Razzil set about carefully concocting a tincture for it to drink, made from the moulds and mosses growing in the prison stone work. In a week's time, it seemed ready. When the ogre drank the potion, it flew into an unstoppable berserker rage, destroying the cell bars and exploding through walls and guards alike. They soon found themselves lost somewhere in the forest surrounding the city with a trail of wreckage in their wake and no signs of pursuit. In the tonic's afterglow, the ogre seemed serene, happy, and even eager. Resolving to work together, the pair set off to collect the materials needed to attempt Razzil's Alchemic transmutation once more.",
  "StrengthIni": 25,
  "AgilityIni": 11,
  "IntelligenceIni": 25,
  "StrengthGain": 2.1,
  "AgilityGain": 1.2,
  "IntelligenceGain": 1.8,
  "Speed": 295,
  "AttackMinIni": 24,
  "AttackMaxIni": 33,
  "DefenseIni": 0,
  "TurnRate": 0.6,
  "AttackRange": 150,
  "BAT": 1.7,
  "Abilities" : [
    {
      "id": 5365,
      "dname": 	"Acid Spray",
      "affects": "ABILITY: <span >Point Target</span><br />DAMAGE TYPE: <span ><font color=\"#71a9ea\">Physical</font></span><br />PIERCES SPELL IMMUNITY: <span ><font color=\"#70EA72\">Yes</font></span><br />",
      "desc": "Sprays high-pressure acid across a target area. Enemy units who step across the contaminated terrain take damage per second and have their armor reduced.",
      "notes": "",
      "dmg": "",
      "attribute": "RADIUS: <span >400 / 475 / 550 / 625</span><br />\nDURATION: <span >16</span><br />\nDAMAGE PER SECOND: <span >15 / 20 / 25 / 30</span>Armor Reduction: 4 / 5 / 6 / 7<br/>",
      "cmb": "<img src=\"mana\"/> 130/140/150/160  &emsp <img src=\"cooldown\"/> 22",
      "lore": "Using traditional Alchemy from the Darkbrew family, Razzil concocts an acid that dissolves even the toughest metals.",
      "image": "skill_5365",
      "mainSkill": 1
    },
    {
      "id": 5366,
      "dname": "Unstable Concoction",
      "affects": 	"ABILITY: <span >No Target</span><br />DAMAGE TYPE: <span ><font color=\"#71a9ea\">Physical</font></span><br />PIERCES SPELL IMMUNITY: <span >No</span><br />",
      "desc": "Alchemist brews up an unstable concoction that he can throw at an enemy hero, to stun and deal damage in an area around the explosion. The longer the concoction brews, the more damage it deals and the longer the stun. After 5 seconds, the brew reaches its maximum damage and stun time. However, after 5.5 seconds, the concoction will explode on Alchemist himself if not thrown.",
      "notes": "Alchemist can move and act normally while brewing.<br />A timer above Alchemist's head will indicate the remaining brew time. This timer is visible to enemies.<br />You can deny yourself with this skill.<br />Unstable Concoction cannot be disjointed.<br />Once thrown, Unstable Concoction stops brewing.",
      "dmg": "",
      "attribute": "MAX STUN: <span >1.75 / 2.5 / 3.25 / 4</span><br />\nMAX DAMAGE: <span >150 / 220 / 290 / 360</span><br />\nEXPLOSION RADIUS: <span >200</span><br/>",
      "cmb": "<img src=\"mana\" /> 120 &emsp <img src=\"cooldown\"/> 22/20/18/16",
      "lore": "A silver lining to the failure of turning a mountain into gold, this volatile solution has destructive potential.",
      "image": "skill_5366",
      "mainSkill": 1
    },
    {
      "id": 5367,
      "dname": "Unstable Concoction Throw",
      "affects": "ABILITY: <span >Unit Target</span><br />AFFECTS: <span >Enemy Heroes</span><br />PIERCES SPELL IMMUNITY: <span >No</span><br />",
      "desc": "Throw it before it blows up!",
      "notes": "Cannot target spell immune units. When the projectile connects with a spell immune unit, it still affects other units within the radius.",
      "dmg": "",
      "attribute": "",
      "cmb": "",
      "lore": "",
      "image": "skill_5367",
      "mainSkill": 0
    },
    {
      "id": 5368,
      "dname": "Greevil's Greed",
      "affects": "ABILITY: <span >Passive</span><br />",
      "desc": "Alchemist synthesizes additional gold from his enemies and bounty runes. With each kill, Alchemist earns base bonus gold and extra bonus gold. If Alchemist kills another unit which yields gold within the next 30 seconds, an additional instance of Extra Bonus Gold is added to the total. Additionally, causes bounty runes to yield 2.5 times their normal gold.",
      "notes": "Using items does not trigger Aftershock.",
      "dmg": "",
      "attribute": "RECENT KILL WINDOW: <span >30</span><br />\nBASE BONUS GOLD: <span >4</span><br />\nEXTRA BONUS GOLD: <span >4</span><br />\nMAX BONUS GOLD PER KILL: <span >16 / 20 / 24 / 28</span><br />\nBOUNTY RUNE MULTIPLIER: <span >2.5</span><br/>",
      "cmb": "",
      "lore": 	"While it is not a mountain, Razzil has mastered the conversion of smaller compounds to line his pockets.",
      "image": "skill_5368",
      "mainSkill": 1
    },
    {
      "id": 5369,
      "dname": "Chemical Rage",
      "affects": "ABILITY: <span >No Target</span><br />",
      "desc": "Alchemist causes his Ogre to enter a chemically induced rage, reducing base attack cooldown and increasing movement speed and regeneration.",
      "notes": "Has a 0.35 second transformation time, which can be used to dodge projectiles and stuns.",
      "dmg": 	"",
      "attribute": 	"DURATION: <span >25</span><br />\nBASE ATTACK TIME: <span >1.4 / 1.2 / 1</span><br />\nBONUS HEALTH REGEN: <span >50 / 75 / 100</span><br />\nBONUS MANA REGEN: <span >3 / 7.5 / 12</span><br />\nBONUS MOVE SPEED: <span >40 / 50 / 60</span><br/>",
      "lore": "Tectonic plates crack, mountains fold, and foes are crushed by the Echo Slam.",
      "cmb": "<img src=\"mana\"/> 50/100/150 &emsp <img src=\"cooldown\"/> 55",
      "image": "skill_5369",
      "mainSkill": 1
    }
  ]
}