{
  "Image": "hero_legion_commander",
  "Id": 104,
  "Name": "Legion Commander",
  "Fraction": "Radiant",
  "PrimaryAttribute": "Strength",
  "Bio": "They came without warning. Within the city walls of Stonehall there came a rumble and a terrible sound, and from blackness unknown came a force of beasts numbering beyond count, wielding flame and foul sorcery, slaying and snatching mothers and sons to dark purpose. Of once-mighty Stonehall's military strength only the Bronze Legion, led by the indomitable Commander Tresdin, was near enough to answer the call of battle. They rode into their city, fighting through bloodstained alleyways and burning markets, cutting their way through the monstrous throng to the source of the sudden invasion: an ethereal rift within the city square, and at its precipice thundered their dreaded champion.\n\nEnwrapped in a corrosive shimmer, the leader of the abyssal horde swung its massive blade, cleaving a legionnaire in two as his flesh began to spoil. Tresdin lifted her blood-stained sword and settled her sights on the beast. It turned, smiling at her through a maze of teeth. Heedless of the battle raging around them, they charged one another.\n\nDeflecting blow after blow, the pair danced their deadly duel as the Bronze Legion met its end around them. Tresdin leapt forward as her foe swung its sword to meet her. The odds turned. The attack smashed into Tresdin suddenly, a brutal thrust from the side, but even as her balance slipped she rallied her strength for another stroke. Blade scraped on blade, beyond the hilt to the gnarled paw below, carving it in two in a fearsome spray of sparks and blood. The vile audience looked on in astonishment as she pressed the attack, driving her blade through her foe's flesh into the stampeding heart within. With a scream that split the clouds above, the beast erupted in a torrent of gore and anguish. The stygian portal wavered, the power sustaining the chasm beyond vanishing as suddenly as it had appeared. The remaining invaders fell quickly to Stonehall steel.\n\nThough victorious, the survivors saw little to celebrate: the city lay in ruins, and survivors were few. Fires continued to spread. Unfurling her banners of war, Tresdin gathered what allies she could. Her anger smoldered as she pledged brutal vengeance upon the forces of the abyss, and damned be any who would dare stand in her way.",
  "StrengthIni": 26,
  "AgilityIni": 18,
  "IntelligenceIni": 20,
  "StrengthGain": 2.9,
  "AgilityGain": 1.7,
  "IntelligenceGain": 2.2,
  "Speed": 320,
  "AttackMinIni": 35,
  "AttackMaxIni": 39,
  "DefenseIni": 0,
  "TurnRate": 0.5,
  "AttackRange": 150,
  "BAT": 1.7,
  "Abilities" : [
    {
      "id": 5595,
      "dname": 	"Overwhelming Odds",
      "affects": "ABILITY: <span >Point Target</span><br />DAMAGE TYPE: <span >Magical</span><br />PIERCES SPELL IMMUNITY: <span >No</span><br />",
      "desc": "Turns the enemies' numbers against them, dealing damage and granting you bonus movement speed per unit or per hero.  Deals bonus damage to illusions and summoned units as a percent of their current health.",
      "notes": "",
      "dmg": "",
      "attribute": "BASE DAMAGE: <span >40 / 60 / 80 / 100</span><br />\nDAMAGE PER CREEP: <span >14 / 16 / 18 / 20</span><br />\nDAMAGE PER HERO: <span >30 / 60 / 90 / 120</span><br />\nBONUS SPEED (CREEPS): <span >3%</span><br />\nBONUS SPEED (HEROES): <span >9%</span><br />\nSPEED DURATION: <span >7</span><br />\nRADIUS: <span >330</span><br/>",
      "cmb": "<img src=\"mana\"/> 100/110/120/130  &emsp <img src=\"cooldown\"/> 15",
      "lore": "The archers of Stonehall are ready at Tresdin's command.",
      "image": "legion_commander_overwhelming_odds",
      "mainSkill": 1
    },
    {
      "id": 5596,
      "dname": 	"Press The Attack",
      "affects": 	"ABILITY: <span >Unit Target</span><br />AFFECTS: <span >Allied Units</span><br />PIERCES SPELL IMMUNITY: <span >No</span><br />",
      "desc": "Removes debuffs and disables from the target friendly unit, and grants bonus attack speed and health regen for a short time.\nDISPEL TYPE: Strong Dispel",
      "notes": "",
      "dmg": "",
      "attribute": "DURATION: <span >5</span><br />\nBONUS ATTACK SPEED: <span >65 / 90 / 115 / 140</span><br />\nHP REGEN: <span >30 / 40 / 50 / 60</span><br/>",
      "cmb": "<img src=\"mana\" /> 110 &emsp <img src=\"cooldown\"/> 16/15/14/13",
      "lore": "The rallying horn of the Bronze Legion is able to inspire any heart.",
      "image": "legion_commander_press_the_attack",
      "mainSkill": 1
    },
    {
      "id": 5597,
      "dname": "Moment of Courage",
      "affects":"ABILITY: <span >Passive</span><br />",
      "desc":"When attacked, Legion Commander has a chance to immediately counterattack with bonus lifesteal.",
      "notes": "",
      "dmg": "",
      "attribute": 	"COUNTERATTACK CHANCE: <span >25%</span><br />\nLIFESTEAL: <span >55% / 65% / 75% / 85%</span><br/>",
      "cmb": "<img src=\"cooldown\"/> 2.30/1.80/1.30/0.80",
      "lore": "The earth trembles beneath the mighty footsteps of Raigor.",
      "image": "legion_commander_moment_of_courage",
      "mainSkill": 1
    },
    {
      "id": 5598,
      "dname": "Duel",
      "affects": "ABILITY: <span >Unit Target</span><br />AFFECTS: <span >Enemy Heroes</span><br />PIERCES SPELL IMMUNITY: <span ><font color=\"#70EA72\">Yes</font></span><br />",
      "desc": 	"Legion Commander and the target enemy hero are forced to attack each other for a short duration.  Neither hero can use items or abilities.  If either hero dies during the duration, the hero winning the Duel gains permanent bonus damage.\r\n\r\nUpgradable by Aghanim's Scepter.",
      "notes":"Duels will end if the units are pushed 2000 units apart.",
      "dmg": "",
      "attribute": "DURATION: <span >4 / 4.75 / 5.5</span><br />\n<font size=\"3\" color=\"#6fe871\">SCEPTER DURATION:</font> <span >6 / 7 / 8</span><br/>",
      "lore": 	"To face a soldier of Stonehall in single combat is a challenge few can resist.",
      "cmb": "<img src=\"mana\"/> 75 &emsp <img src=\"cooldown\"/> 50",
      "image": "legion_commander_duel",
      "mainSkill": 1
    }
  ]
}