{
  "Id": 6,
  "Name": "Drow Ranger",
  "Fraction": "Radiant",
  "PrimaryAttribute": "Agility",
  "Bio": "Drow Ranger's given name is Traxex--a name well suited to the short, trollish, rather repulsive Drow people. But Traxex herself is not a Drow. Her parents were travelers in a caravan set upon by bandits, whose noisy slaughter of innocents roused the ire of the quiet Drow people. After the battle settled, the Drow discovered a small girl-child hiding in the ruined wagons, and agreed she could not be abandoned. Even as child, Traxex showed herself naturally adept at the arts they prized: Stealth, silence, subtlety. In spirit, if not in physique, she might have been a Drow changeling, returned to her proper home. But as she grew, she towered above her family and came to think of herself as ugly. After all, her features were smooth and symmetrical, entirely devoid of warts and coarse whiskers. Estranged from her adopted tribe, she withdrew to live alone in the woods. Lost travelers who find their way from the forest sometimes speak of an impossibly beautiful Ranger who peered at them from deep among the trees, then vanished like a dream before they could approach. Lithe and stealthy, icy hot, she moves like mist in silence. That whispering you hear is her frozen arrows finding an enemy's heart. ",
  "StrengthIni": 17,
  "AgilityIni": 26,
  "IntelligenceIni": 15,
  "StrengthGain": 1.9,
  "AgilityGain": 1.9,
  "IntelligenceGain": 1.4,
  "Speed": 290,
  "AttackMinIni": 14,
  "AttackMaxIni": 25,
  "DefenseIni": -3,
  "TurnRate": 0.7,
  "AttackRange": 625,
  "BAT": 1.7,
  "Abilities" : [
    {
      "id": 5019,
      "dname": "Frost Arrows",
      "affects": "ABILITY: Auto-Cast, Unit Target<br/>AFFECTS: Enemy Units<br/>PIERCES SPELL IMMUNITY: No",
      "desc": "Adds a freezing effect to Drow's attacks, slowing enemy movement.  Lasts 1.5 seconds on Heroes, and 7 seconds on creeps.",
      "notes": 	"The slow duration is refreshed on successive casts.",
      "dmg": "",
      "attribute": "MOVEMENT SLOW: 16% / 32% / 48% / 64%<br/>HERO DURATION: 1.5<br/>CREEP DURATION: 7<br/>",
      "cmb": "<img src=\"mana\"/> 12  &emsp <img src=\"cooldown\"/> 0",
      "lore": "Ice-encased arrows pierce the silence, chilling their victims to the core.",
      "image": "skill_5019",
      "mainSkill": 1
    },
    {
      "id": 5632,
      "dname": "Gust",
      "affects": "ABILITY: Point Target<br/>PIERCES SPELL IMMUNITY: No",
      "desc": "Releases a wave that silences and knocks back enemy units. Knockback distance is relative to how close they are to you.",
      "notes": "",
      "dmg": "",
      "attribute": 	"WIDTH: 250<br/>SILENCE DURATION: 3 / 4 / 5 / 6<br/>KNOCKBACK DURATION: 0.6 / 0.7 / 0.8 / 0.9<br/>",
      "cmb": "<img src=\"mana\" /> 90 &emsp <img src=\"cooldown\"/> 16/15/14/13",
      "lore": "Traxex is rather fond of the tranquility of physical combat, calling on her Drow heritage to end the incantations of opposing magi.",
      "image": "skill_5632",
      "mainSkill": 1
    },
    {
      "id": 5021,
      "dname": "Precision Aura",
      "affects": "ABILITY: No Target<br/>AFFECTS: Allies",
      "desc": "Adds bonus damage to the physical attack of allied, ranged Hero units based on a percentage of Drow's agility.  Affects creeps for 30 seconds when cast.",
      "notes": "",
      "dmg": "",
      "attribute": "AGILITY AS RANGED ATTACK DAMAGE BONUS: 10%/20%/30%/40% <br/>",
      "cmb": "<img src=\"cooldown\"/> 100",
      "lore": "Traxex' time spent alone in the forests of her Drow home has allowed her to teach other archers how to improve their bow skills.",
      "image": "skill_5021",
      "mainSkill": 1
    },
    {
      "id": 5022,
      "dname": "Marksmanship",
      "affects": "ABILITY: Passive",
      "desc": "Drow's experiences in battle improve her accuracy and effectiveness in combat, providing a passive bonus to Agility. Grants no bonus if there are enemy heroes within 400 range.Upgradable by Aghanim's Scepter.",
      "notes": "",
      "dmg": "",
      "attribute": "AGILITY BONUS: 35/55/75 <br/> <font size=\"3\" color=\"#6fe871\">SPLIT COUNT:</font>2<br/>SEARCH RANGE: 375<br/><font size=\"3\" color=\"#6fe871\">DAMAGE REDUCTION:</font> 50%<br/>",
      "cmb": "",
      "lore": "The Drow Ranger is the epitome of archery prowess.",
      "image": "skill_5022",
      "mainSkill": 1
    }
  ],
  "Talents": [
    {
      "id": 5918,
      "desc": "+20 Movement Speed"
    },
    {
      "id": 5921,
      "desc": "+5 All Stats"
    },
    {
      "id": 6016,
      "desc": "+25 Attack Speed"
    },
    {
      "id": 6209,
      "desc": "+550 Gust Distance/Knockback"
    },
    {
      "id": 6280,
      "desc": "+20 Marksmanship Agility"
    },
    {
      "id": 6634,
      "desc": "+3s Gust Silence Duration"
    },
    {
      "id": 6202,
      "desc": "+20% Precision Aura Damage"
    },
    {
      "id": 6804,
      "desc": "50% Cooldown Reduction"
    }
  ]
}