{
  "Id": 101,
  "Name": "Skywrath Mage",
  "Fraction": "Radiant",
  "PrimaryAttribute": "Intelligence",
  "Bio": "A highly placed mage in the court of the Ghastly Eyrie, Dragonus lives a troubled existence. Sworn by birth to protect whomever sits within the Nest of Thorns, he hates the current Skywrath queen with all his soul. As a youth, high-born, he was a friend and companion to the eldest Skywrath princess, Shendelzare, first in line for the Nest. He had loved her warmly and unshakably, but as his studies took hold, his mind turned to arcane learning and the mastery of Skywrath sorcery.\n\n Obsessed with matters aetherial, he missed the mundane signs of courtly treachery that hinted at a plot against Shendelzare, and lost his chance to foil it. When the court was shaken by a swift and violent coup, he emerged from his studies to discover his oldest and dearest friend had been lost to him. The Nest of Thorns now belonged to Shendelzare's ruthless younger sister, and Dragonus could do nothing. The magic of the Skywrath Mage serves only the sworn protector of the Skywrath scion, so to act against the Nest would render him helpless. He clings to his post, believing it to be the best hope of one day restoring his true love to her rightful place. Meanwhile, his secret is known only to the goddess Scree'auk, whose magic it was transformed Shendelzare from a crippled physical creature into an embodiment of pure vengeful energy. While he dreams of restoring his beloved queen to the Ghastly Eyrie, he dreams even more desperately of restoring Shendelzare herself to a fully healed physical form. The duplicity of his role at court tortures him, for he is a noble and good-hearted creature; but the worst torture of all is imagining the hatred that Vengeful Spirit must hold in her heart for him.",
  "StrengthIni": 19,
  "AgilityIni": 13,
  "IntelligenceIni": 27,
  "StrengthGain": 1.8,
  "AgilityGain": 0.8,
  "IntelligenceGain": 3.6,
  "Speed": 330,
  "AttackMinIni": 12,
  "AttackMaxIni": 22,
  "DefenseIni": -2,
  "TurnRate": 0.5,
  "AttackRange": 600,
  "BAT": 1.7,
  "Abilities" : [
    {
      "id": 5581,
      "dname": "Arcane Bolt",
      "affects": "ABILITY: <span>Unit Target</span><br />AFFECTS: <span>Enemy Units</span><br />DAMAGE TYPE: <span>Magical</span><br />PIERCES SPELL IMMUNITY: <span>No</span><br />",
      "desc": "Skywrath Mage launches a slow-moving bolt of arcane magic, dealing damage to an enemy unit based on Skywrath Mage's intelligence.",
      "notes": "The projectile moves very slowly (500 ms), providing 325 vision around it.  Upon impact, it will reveal the target area for 3.34 seconds.<br />Arcane Bolt cannot be disjointed.",
      "dmg": "",
      "attribute": "BASE DAMAGE: <span>60 / 80 / 100 / 120</span><br/>",
      "cmb": "<img src=\"mana\"/> 70  &emsp <img src=\"cooldown\"/> 5/4/3/2",
      "lore": "Within the Ghastly Eyrie's endless intrigue, only the clever and calm can hope to survive.",
      "image": "skill_5581",
      "mainSkill": 1
    },
    {
      "id": 5582,
      "dname": "Concussive Shot",
      "affects": "ABILITY: <span>No Target</span><br />DAMAGE TYPE: <span>Magical</span><br />PIERCES SPELL IMMUNITY: <span>No</span><br />",
      "desc": "Skywrath Mage sets off a long range shot that hits the closest hero within a long range.  Upon impact, it deals damage and slows in an area of effect.",
      "notes": "Does not work when no heroes are in range or heroes are in fog.<br />Damages creeps around the impact area.<br />Provides 400 vision around the projectile, and reveals the target area for 3.34 seconds upon impact.",
      "dmg": "",
      "attribute": "SHOT RANGE: <span>1600</span><br />\nDAMAGE RADIUS: <span>250</span><br />\nDAMAGE: <span>70 / 140 / 210 / 280</span><br />\nSLOW DURATION: <span>4</span><br />\nSLOW: <span>30% / 35% / 40% / 45%</span><br/>",
      "cmb": "<img src=\"mana\" /> 95 &emsp <img src=\"cooldown\"/> 18/16/14/12",
      "lore": "Those who serve the court of the Ghastly Eyrie are ever locked in covert war. One must always know where danger lurks nearest.",
      "image": "skill_5582",
      "mainSkill": 1
    },
    {
      "id": 5583,
      "dname": "Ancient Seal",
      "affects": "ABILITY: <span>Unit Target</span><br />AFFECTS: <span>Enemy Units</span><br />PIERCES SPELL IMMUNITY: <span>No</span><br />",
      "desc": "Skywrath Mage seals the targeted unit with an ancient rune, silencing it and causing it to take additional damage from spells.",
      "notes": "The magic damage resistance reduction doesn't affect creeps.",
      "dmg": "",
      "attribute": "INCREASED MAGIC DAMAGE: <span>30% / 35% / 40% / 45%</span><br />\nDURATION: <span>3 / 4 / 5 / 6</span><br/>",
      "cmb": "<img src=\"mana\" /> 80/90/100/110 &emsp <img src=\"cooldown\"/> 14",
      "lore": "A holy incantation, whosoever finds themselves touched by Avilliva's sigil must suffer in penitent silence.",
      "image": "skill_5583",
      "mainSkill": 1
    },
    {
      "id": 5584,
      "dname": "Mystic Flare",
      "affects": "ABILITY: <span>Point Target</span><br />DAMAGE TYPE: <span>Magical</span><br />PIERCES SPELL IMMUNITY: <span>No</span><br />",
      "desc": "Skywrath Mage uses his ultimate magical ability to conjure a precise and violent mystical field that lays waste to his adversaries. Deals massive damage distributed evenly among any Heroes in the area over 2.4 seconds.\r\n\r\nUpgradable by Aghanim's Scepter.",
      "notes": "Mystic Flare only affects Heroes; it does not damage illusions or creep heroes.<br />Spell immune enemies do not count toward the damage distribution.",
      "dmg": "",
      "attribute": "RADIUS: <span>170</span><br />\nDURATION: <span>2.4</span><br />\nDAMAGE: <span>600 / 1000 / 1400</span><br/>",
      "cmb": "<img src=\"mana\"/> 300/550/800 &emsp <img src=\"cooldown\"/> 60/40/20",
      "lore": "Only the most practiced of Skywrath sorcerers could hope to shape the skies into such a storm.",
      "image": "skill_5584",
      "mainSkill": 1
    }
  ],
  "Talents": [
    {
      "id": 5919,
      "desc": "+25 Movement Speed"
    },
    {
      "id": 5925,
      "desc": "+8 Intelligence"
    },
    {
      "id": 6181,
      "desc": "-8s Ancient Seal Cooldown"
    },
    {
      "id": 6884,
      "desc": "+1 Arcane Bolt Per Cast"
    },
    {
      "id": 6886,
      "desc": "Global Concussive Shot"
    },
    {
      "id": 6885,
      "desc": "+15% Ancient Seal Magic Resistance Reduction"
    },
    {
      "id": 6318,
      "desc": "+300 Gold/Min"
    },
    {
      "id": 6921,
      "desc": "+600 Mystic Flare Damage"
    }
  ]
}