{
  "Image": "hero_luna",
  "Id": 48,
  "Name": "Luna",
  "Fraction": "Radiant",
  "PrimaryAttribute": "Agility",
  "Bio": "How had she been reduced to this? She was once the Scourge of the Plains, a merciless leader of men and beasts, and able to sow terror wherever she dared. Now she was far from her homeland, driven half mad from starvation and months of wandering, her army long dead or worse. As she stood at the edge of an ancient forest, a pair of glowing eyes spied on from an elder branch. Something beautiful and deadly sought a meal in the wilting dusk. Without a sound, it turned and left. Fury overtook her. Clutching a rust-eaten dagger, she charged after the beast determined to reclaim even a shred of her past glory, but her quarry would not be caught. Three times she cornered the creature among the rocks and trees, and three times she pounced only to witness its fading shadow darting further into the woods. Yet the full moon shone brightly, and the creature's trail was easy to follow. Arriving in a clearing atop a high hill, the beast's massive feline form sat in the open, attentive and waiting. When the woman brandished her dagger, the creature reared and roared and charged. Death, it seemed, had come for her at long last in this strange place. She stood, calm and ready. A flash of movement, and the beast snatched the dagger from her hand before vanishing into the forest. Stillness. Hooded figures approached. In reverent tones they revealed that Selemene, Goddess of the Moon, had chosen her, had guided her, had tested her. Unwittingly she had endured the sacred rites of the Dark Moon, warriors of the Nightsilver Woods.\n\nShe was offered a choice: join the Dark Moon and pledge herself to the service of Selemene, or leave and never return. She did not hesitate. Embracing her absolution, she renounced her bloody past, and took up a new mantle as Luna of the Dark Moon, the dreaded Moon Rider, ruthless and ever-loyal guardian of the Nightsilver Woods.",
  "StrengthIni": 15,
  "AgilityIni": 18,
  "IntelligenceIni": 16,
  "StrengthGain": 2.5,
  "AgilityGain": 3.3,
  "IntelligenceGain": 1.85,
  "Speed": 335,
  "AttackMinIni": 20,
  "AttackMaxIni": 26,
  "DefenseIni": 0,
  "TurnRate": 0.6,
  "AttackRange": 330,
  "BAT": 1.7,
  "Abilities" : [
    {
      "id": 5222,
      "dname": 	"Lucent Beam",
      "affects": "ABILITY: <span >Unit Target</span><br />AFFECTS: <span >Enemy Units</span><br />DAMAGE TYPE: <span >Magical</span><br />PIERCES SPELL IMMUNITY: <span >No</span><br />",
      "desc": "Calls a beam of lunar energy down upon an enemy, damaging and briefly stunning them.",
      "notes": "",
      "dmg": "DAMAGE: <span>75/150/225/300</span><br />",
      "attribute": "STUN DURATION: <span >0.8</span><br/>",
      "cmb": "<img src=\"mana\"/> 90/100/110/120  &emsp <img src=\"cooldown\"/> 6",
      "lore": "Selemene smites those who encroach upon the Nightsilver Woods.",
      "image": "skill_5222",
      "mainSkill": 1
    },
    {
      "id": 5223,
      "dname": 	"Moon Glaive",
      "affects": "ABILITY: <span >Passive</span><br />PIERCES SPELL IMMUNITY: <span ><font color=\"#70EA72\">Yes</font></span><br />",
      "desc": "Empowers Luna's glaive, causing her attacks to bounce between enemy units. Deals less damage with each bounce.",
      "notes": "",
      "dmg": "",
      "attribute": "BOUNCE RADIUS: <span >500</span><br />\nBOUNCES: <span >1 / 2 / 3 / 6</span><br />\nDAMAGE REDUCTION PER BOUNCE: <span >35%</span><br/>",
      "cmb": "",
      "lore": "Carefully sharpened, Luna's boomerang-like weapon cuts a wide swath through enemy numbers.",
      "image": "skill_5223",
      "mainSkill": 1
    },
    {
      "id": 5224,
      "dname": 	"Lunar Blessing",
      "affects": "ABILITY: <span >Passive</span><br />",
      "desc": "Increases the damage dealt by attacks from Luna and nearby allied heroes. Luna is also blessed with increased vision range at night.",
      "notes": "",
      "dmg": "",
      "attribute": "BLESSING RADIUS: <span >900 / 900 / 900 / 900</span><br />\nBONUS DAMAGE: <span >14 / 22 / 30 / 38</span><br />\nBONUS NIGHT VISION: <span >250 / 500 / 750 / 1000</span><br/>",
      "cmb": "",
      "lore": "The Goddess of the Moon smiles upon her kin.",
      "image": "skill_5224",
      "mainSkill": 1
    },
    {
      "id": 5225,
      "dname": 	"Eclipse",
      "affects": "ABILITY: <span >No Target</span><br />AFFECTS: <span >Allied Units</span><br />DAMAGE TYPE: <span >Magical</span><br />PIERCES SPELL IMMUNITY: <span >No</span><br />",
      "desc": "Showers random nearby enemies with strikes from Luna's current level of Lucent Beam. These beams do not stun their targets, and there is a maximum number of times that a single target can be struck. Also turns day into night for 10 seconds.\nUpgradable by Aghanim's Scepter.",
      "notes": "Eclipse doesn't work if Luna doesn't have any points in Lucent Beam.<br />Beams will stop if Luna is killed.<br />Eclipse Lucent Beams do not stun.<br />Will not hit invisible units.<br />There is a .6 seconds gap between beams, .3 seconds with scepter.",
      "dmg": "",
      "attribute": "TOTAL BEAMS: <span >5 / 8 / 11</span><br />\nMAX BEAMS PER UNIT: <span >5</span><br />\nECLIPSE DURATION: <span >2.4 / 4.2 / 6</span><br />\nRADIUS: <span >675 / 675 / 675</span><br />\n<font size=\"3\" color=\"#6fe871\">SCEPTER TOTAL BEAMS:</font> <span >6 / 12 / 18</span><br />\n<font size=\"3\" color=\"#6fe871\">SCEPTER DURATION:</font> <span >1.8 / 3.6 / 5.4</span><br />\n<font size=\"3\" color=\"#6fe871\">SCEPTER CAST RANGE:</font> <span >2500</span><br/>",
      "cmb": "<img src=\"mana\"/> 150/200/250 &emsp <img src=\"cooldown\"/> 140",
      "lore": "In times of great need, Selemene herself descends into the world, blocking out the light and hope of the opposed.",
      "image": "skill_5225",
      "mainSkill": 1
    }
  ]
}