{
  "Image": "hero_rubick",
  "Id": 86,
  "Name": "Rubick",
  "Fraction": "Radiant",
  "PrimaryAttribute": "Intelligence",
  "Bio": "Any mage can cast a spell or two, and a few may even study long enough to become a wizard, but only the most talented are allowed to be recognized as a Magus. Yet as with any sorcerer’s circle, a sense of community has never guaranteed competitive courtesy. \n\n Already a renowned duelist and scholar of the grander world of sorcery, it had never occurred to Rubick that he might perhaps be Magus material until he was in the midst of his seventh assassination attempt. As he casually tossed the twelfth of a string of would-be killers from a high balcony, it dawned on him how utterly unimaginative the attempts on his life had become. Where once the interruption of a fingersnap or firehand might have put a cheerful spring in his step, it had all become so very predictable. He craved greater competition. Therefore, donning his combat mask, he did what any wizard seeking to ascend the ranks would do: he announced his intention to kill a Magus. \n\n Rubick quickly discovered that to threaten one Magus is to threaten them all, and they fell upon him in force. Each antagonist's spell was an unstoppable torrent of energy, and every attack a calculated killing blow. But very soon something occurred that Rubick's foes found unexpected: their arts appeared to turn against them. Inside the magic maelstrom, Rubick chuckled, subtly reading and replicating the powers of one in order to cast it against another, sowing chaos among those who had allied against him. Accusations of betrayal began to fly, and soon the sorcerers turned one upon another without suspecting who was behind their undoing. \n\n When the battle finally drew to a close, all were singed and frozen, soaked and cut and pierced. More than one lay dead by an ally’s craft. Rubick stood apart, sore but delighted in the week’s festivities. None had the strength to argue when he presented his petition of assumption to the Hidden Council, and the Insubstantial Eleven agreed as one to grant him the title of Grand Magus.",
  "StrengthIni": 19,
  "AgilityIni": 14,
  "IntelligenceIni": 27,
  "StrengthGain": 1.8,
  "AgilityGain": 1.6,
  "IntelligenceGain": 2.4,
  "Speed": 290,
  "AttackMinIni": 17,
  "AttackMaxIni": 27,
  "DefenseIni": -1,
  "TurnRate": 0.7,
  "AttackRange": 550,
  "BAT": 1.7,
  "Abilities" : [
    {
      "id": 5448,
      "dname": "Telekinesis",
      "affects": "ABILITY: <span>Unit Target</span><br />AFFECTS: <span>Enemy Units</span><br />PIERCES SPELL IMMUNITY: <span>No</span><br />",
      "desc": "Rubick uses his telekinetic powers to lift the enemy into the air briefly and then hurls them back at the ground. The unit lands on the ground with such force that it stuns nearby enemies.",
      "notes": "While the target is in the air, Rubick may use a secondary ability to throw the enemy in a targeted direction.<br />When the unit lands, it isn't affected by the area of effect stun.<br />The farthest you can throw an enemy is 375.",
      "dmg": "",
      "attribute": "LIFT DURATION: <span>1.5 / 1.75 / 2 / 2.25</span><br />\nSTUN DURATION: <span>1 / 1.25 / 1.5 / 1.75</span><br />\nIMPACT RADIUS: <span>325 / 325 / 325 / 325</span><br />\nCAST RANGE: <span>550 / 575 / 600 / 625</span><br/>",
      "cmb": "<img src=\"mana\"/> 125  &emsp <img src=\"cooldown\"/> 22",
      "lore": "Even the Grandest Magus may use his powers for enjoyment.",
      "image": "skill_5448",
      "mainSkill": 1
    },
    {
      "id": 5449,
      "dname": "Telekinesis Land",
      "affects": "ABILITY: <span>Point Target</span><br />",
      "desc": "Chooses the location the target will land when Telekinesis finishes.",
      "notes": "",
      "dmg": "",
      "attribute": "",
      "cmb": "",
      "lore": "",
      "image": "skill_5449",
      "mainSkill": 0
    },
    {
      "id": 5450,
      "dname": "Fade Bolt",
      "affects": "ABILITY: <span>Unit Target</span><br />AFFECTS: <span>Enemy Units</span><br />DAMAGE TYPE: <span>Magical</span><br />PIERCES SPELL IMMUNITY: <span>No</span><br />",
      "desc": "Rubick creates a powerful stream of arcane energy that travels between enemy units, dealing damage and reducing their attack damage.  Each jump deals less damage.",
      "notes": "",
      "dmg": "",
      "attribute": "DAMAGE: <span>80 / 160 / 240 / 320</span><br />\nDEBUFF DURATION: <span>10 / 10 / 10 / 10</span><br/>",
      "cmb": "<img src=\"mana\" /> 120/130/140/150 &emsp <img src=\"cooldown\"/> 16/14/12/10",
      "lore": "Rubick's favorite spell for dispatching would-be assassins is a rather simple conjuration.",
      "image": "skill_5450",
      "mainSkill": 1
    },
    {
      "id": 5451,
      "dname": "Null Field",
      "affects": "ABILITY: <span>Passive</span><br />",
      "desc": "Rubick's mastery of the arcane protects nearby allies against weaker magics, granting them magic resistance.",
      "notes": "Stacks multiplicatively with other spell resistance sources.",
      "dmg": "",
      "attribute": "MAGIC RESISTANCE: <span>10% / 14% / 18% / 22%</span><br />\nRADIUS: <span>900</span><br/>",
      "cmb": "",
      "lore": "Not every magus can be a Grand Magus...",
      "image": "skill_5451",
      "mainSkill": 1
    },
    {
      "id": 5452,
      "dname": "Spell Steal",
      "affects": "ABILITY: <span>Unit Target</span><br />AFFECTS: <span>Enemy Heroes</span><br />PIERCES SPELL IMMUNITY: <span><font color=\"#70EA72\">Yes</font></span><br />",
      "desc": "Rubick studies the trace magical essence of one enemy hero, learning the secrets of the last spell the hero cast. Rubick can use this spell as his own for several minutes or until he dies.\nUpgradable by Aghanim's Scepter.",
      "notes": "Cannot steal item abilities.",
      "dmg": "",
      "attribute": "DURATION: <span>180 / 240 / 300</span><br />\n<font size=\"3\" color=\"#6fe871\">SCEPTER COOLDOWN:</font> <span>2</span><br/>",
      "cmb": "<img src=\"mana\"/> 25 &emsp <img src=\"cooldown\"/> 20/18/16",
      "lore": "...but even their lesser magics can be a source of much utility.",
      "image": "skill_5452",
      "mainSkill": 1
    }
  ]
}