{
  "Image": "hero_antimage",
  "Id": 1,
  "Name": "Anti-Mage",
  "Fraction": "Radiant",
  "PrimaryAttribute": "Agility",
  "Bio": "The monks of Turstarkuri watched the rugged valleys below their mountain monastery as wave after wave of invaders swept through the lower kingdoms. Ascetic and pragmatic, in their remote monastic eyrie they remained aloof from mundane strife, wrapped in meditation that knew no gods or elements of magic. Then came the Legion of the Dead God, crusaders with a sinister mandate to replace all local worship with their Unliving Lord's poisonous nihilosophy. From a landscape that had known nothing but blood and battle for a thousand years, they tore the souls and bones of countless fallen legions and pitched them against Turstarkuri. The monastery stood scarcely a fortnight against the assault, and the few monks who bothered to surface from their meditations believed the invaders were but demonic visions sent to distract them from meditation. They died where they sat on their silken cushions. Only one youth survived--a pilgrim who had come as an acolyte, seeking wisdom, but had yet to be admitted to the monastery. He watched in horror as the monks to whom he had served tea and nettles were first slaughtered, then raised to join the ranks of the Dead God's priesthood. With nothing but a few of Turstarkuri's prized dogmatic scrolls, he crept away to the comparative safety of other lands, swearing to obliterate not only the Dead God's magic users--but to put an end to magic altogether.",
  "StrengthIni": 22,
  "AgilityIni": 22,
  "IntelligenceIni": 15,
  "StrengthGain": 1.5,
  "AgilityGain": 2.8,
  "IntelligenceGain": 1.8,
  "Speed": 315,
  "AttackMinIni": 27,
  "AttackMaxIni": 31,
  "DefenseIni": -1,
  "TurnRate": 0.5,
  "AttackRange": 150,
  "BAT": 1.45,
  "Abilities": [
    {
      "id": 5003,
      "dname": "Mana Break",
      "affects": "ABILITY: <span >Passive</span><br />DAMAGE TYPE: <span ><font color=\"#71a9ea\">Physical</font></span><br />PIERCES SPELL IMMUNITY: <span >No</span><br />",
      "desc": "Burns an opponent's mana on each attack.  Mana Break deals 60% of the mana burned as damage to the target.\r\n\r\nMana Break is a Unique Attack Modifier, and does not stack with other Unique Attack Modifiers.",
      "notes": "Mana Burn is blocked by spell immunity.<br />You can lifeleech the damage dealt by this skill with a Lifesteal aura.",
      "dmg": "",
      "attribute": "MANA BURNED PER HIT: <span >28 / 40 / 52 / 64</span><br/>",
      "cmb": "",
      "lore": "A modified technique of the Turstarkuri monks' peaceful ways is to turn magical energies on their owner.",
      "image": "skill_5003",
      "mainSkill": 1
    },
    {
      "id": 5004,
      "dname": "Blink",
      "affects": "ABILITY: <span >Point Target</span><br />",
      "desc": "Short distance teleportation that allows Anti-Mage to move in and out of combat.",
      "notes": "You can use Blink to dodge incoming projectiles.",
      "dmg": "",
      "attribute": "RANGE: <span >925 / 1000 / 1075 / 1150</span><br/>",
      "cmb": "<img src=\"mana\" /> 60 &emsp <img src=\"cooldown\"/> 12/9/7/5",
      "lore": "In his encounter with the Dead Gods, Anti-Mage learned the value of being elusive.",
      "image": "skill_5004",
      "mainSkill": 1
    },
    {
      "id": 5005,
      "dname": "Spell Shield",
      "affects": "ABILITY: <span >Passive</span><br />",
      "desc": "Increases Anti-Mage's resistance to magic damage.\nUpgradable by Aghanim's Scepter.",
      "notes": "Stacks multiplicatively with other spell resistance sources.",
      "dmg": "",
      "attribute": "RESISTANCE: <span >26% / 34% / 42% / 50%</span><br/>",
      "cmb": "",
      "lore": "Years of meditation and obsession with revenge have hardened Anti-Mage's skin against mystical opponents.",
      "image": "skill_5005",
      "mainSkill": 1
    },
    {
      "id": 5006,
      "dname": "Mana Void",
      "affects": "ABILITY: <span >Unit Target</span><br />AFFECTS: <span >Enemy Units</span><br />DAMAGE TYPE: <span >Magical</span><br />PIERCES SPELL IMMUNITY: <span ><font color=\"#70EA72\">Yes</font></span><br /><br />",
      "desc": "For each point of mana missing by the target unit, damage is dealt to it and surrounding enemies.  The main target is also mini-stunned.",
      "notes": "The stun passes through spell immunity.<br />Damage is calculated based on the primary target's mana, but applied to all enemies within the area of effect.",
      "dmg": "",
      "attribute": "DAMAGE: <span >0.6 / 0.85 / 1.1</span><br />\nSTUN DURATION: <span >0.3</span><br />\nRADIUS: <span >500</span><br/>",
      "cmb": "<img src=\"mana\"/> 125/200/275 &emsp <img src=\"cooldown\"/> 70",
      "lore": "After bringing enemies to their knees, Anti-Mage punishes them for their use of the arcane arts.",
      "image": "skill_5006",
      "mainSkill": 1
    }
  ],
  "Talents": [
    {
      "id": 6137,
      "desc": "+10 Strength"
    },
    {
      "id": 5906,
      "desc": "+20 Attack Speed"
    },
    {
      "id": 6606,
      "desc": "+400 Blink Cast Range"
    },
    {
      "id": 5929,
      "desc": "+15 Agility"
    },
    {
      "id": 6800,
      "desc": "Blink Uncontrollable Illusion"
    },
    {
      "id": 6012,
      "desc": "-2.5s Blink Cooldown"
    },
    {
      "id": 6607,
      "desc": "+25% Spell Shield"
    },
    {
      "id": 6353,
      "desc": "-50s Mana Void Cooldown"
    }
  ]
}