{
  "Image": "hero_pugna",
  "Id": 45,
  "Name": "Pugna",
  "Fraction": "Dire",
  "PrimaryAttribute": "Intelligence",
  "Bio": "n the realm of Pugna's birth, near the vents of the Nether Reaches, there stood a lamasery devoted to the Arts of Oblivion, which drew its power from the nether energies. The Grandmaster of the temple compound had himself passed into Oblivion several years prior, leaving his academy without a leader. From the moment of their master's death, the regents of the temple began rites of divination to identify their master's reincarnation, and eventually all signs converged on the immediate neighborhood. Several villages squatted in the shadow of the temple, their alleys and plazas full of the laughter of squalling children. Pugna, a mere thirteen months of age, was but one candidate among the local brats, and on the appointed day he was presented at the temple alongside two other promising tots. The lamas offered a jumble of worn relics to the children, treasured possessions of their former grandmaster. One boy reached for a porphyry wand that had belonged to the lama...and put it in his nostril. An impish girl pulled out an amulet that had also been the lama's, and immediately swallowed it. Pugna regarded the other two coolly, gave a merry laugh, and blasted them with gouts of emerald flame, reducing them to ashes in an instant. He then snatched up the wand and amulet, saying 'Mine!' The regents hoisted the beaming Pugna on their shoulders, wrapped him in their grandmaster's vestments, and rushed him to the throne before his mood could change. Within five years, the temple itself was another pile of ash, which pleased Pugna to no end.",
  "StrengthIni": 17,
  "AgilityIni": 16,
  "IntelligenceIni": 26,
  "StrengthGain": 1.5,
  "AgilityGain": 1,
  "IntelligenceGain": 4.5,
  "Speed": 335,
  "AttackMinIni": 19,
  "AttackMaxIni": 27,
  "DefenseIni": -1,
  "TurnRate": 0.5,
  "AttackRange": 630,
  "BAT": 1.7,
  "Abilities" : [
    {
      "id": 5186,
      "dname": "Nether Blast",
      "affects": "ABILITY: <span>Point Target</span><br />DAMAGE TYPE: <span>Magical</span><br />PIERCES SPELL IMMUNITY: <span>No</span><br />",
      "desc": "An exploding pulse deals damage to enemies and structures in the area.  Deals half damage to structures.",
      "notes": "Damage is delayed by 0.9 seconds.",
      "dmg": "DAMAGE: <span>100 / 175 / 250 / 325</span><br />",
      "attribute": "BLAST DELAY: <span>0.9</span><br />\nRADIUS: <span> 400</span><br/>",
      "cmb": "<img src=\"mana\"/> 85/105/125/145  &emsp <img src=\"cooldown\"/> 5",
      "lore": "The Arts of Oblivion include a deafening blast of emerald flames from the Nether Reaches.",
      "image": "pugna_nether_blast",
      "mainSkill": 1
    },
    {
      "id": 5187,
      "dname": "Decrepify",
      "affects": "ABILITY: <span>Unit Target</span><br />PIERCES SPELL IMMUNITY: <span>No</span><br />",
      "desc": "A powerful banishing spell that slows a unit and renders it unable to attack or be attacked. Afflicted units take extra magic damage.",
      "notes": "Only magical and pure damage can affect a unit under the effects of Decrepify.<br />Doesn't slow allied units.<br />Can be used on your Nether Ward.",
      "dmg": "",
      "attribute": "ALLY INCREASED MAGIC DAMAGE: <span>25%</span><br />\nENEMY INCREASED MAGIC DAMAGE: <span>30% / 40% / 50% / 60%</span><br />\nENEMY MOVE SLOW: <span>30% / 40% / 50% / 60%</span><br />\nDURATION: <span>3.5</span><br/>",
      "cmb": "<img src=\"mana\" /> 60 &emsp <img src=\"cooldown\"/> 15/12/9/6",
      "lore": "A now-mastered relic from his childhood, Pugna delights in banishing others into the Nether Realm, whether for good, evil, or simple enjoyment.",
      "image": "pugna_decrepify",
      "mainSkill": 1
    },
    {
      "id": 5188,
      "dname": "Nether Ward",
      "affects": "ABILITY: <span>Point Target</span><br />DAMAGE TYPE: <span>Magical</span><br />PIERCES SPELL IMMUNITY: <span><font color=\"#70EA72\">Yes</font></span><br />",
      "desc": "Pugna places a Nether Ward at the target location. The ward reduces the mana regeneration of nearby enemy heroes, and will fire at any enemy hero who casts a spell. Nether Ward deals damage equal to the damage multiplier times the mana spent by the enemy hero.",
      "notes": "Nether Ward deals damage before the actual spell is cast, so if the caster dies the spell will have no effect.<br />Nether Ward can be decrepified.<br />Nether Ward has 4 HP. Heroes attack it for 1 damage, while illusions and non-hero units deal 0.25 damage.",
      "dmg": "",
      "attribute": "WARD ATTACK RANGE: <span>1600</span><br />\nDAMAGE PER MANA: <span>1 / 1.25 / 1.5 / 1.75</span><br />\nMANA REGEN REDUCTION: <span>0.25 / 0.5 / 0.75 / 1</span><br />\nATTACKS TO DESTROY: <span>4 / 4 / 4 / 4</span><br />\nWARD DURATION: <span>30</span><br/>",
      "cmb": "<img src=\"mana\" /> 80 &emsp <img src=\"cooldown\"/> 35",
      "lore": "While at the lamasery for the Arts of Oblivion, Pugna learned to dominate his classmates with a simple ward charged with Nether magic.",
      "image": "pugna_nether_ward",
      "mainSkill": 1
    },
    {
      "id": 5189,
      "dname": "Life Drain",
      "affects": "ABILITY: <span>Channeled, Unit Target</span><br />AFFECTS: <span>Heroes</span><br />DAMAGE TYPE: <span>Magical</span><br />PIERCES SPELL IMMUNITY: <span><font color=\"#70EA72\">Yes</font></span><br />",
      "desc": "CHANNELED - When cast on an enemy, Pugna drains health from the target enemy unit to heal himself and granting vision over the target. If Pugna has full HP, and the enemy target is a Hero, Life Drain will restore mana instead.\nWhen cast on an ally, Pugna will drain his own health into his ally.\nUpgradable by Aghanim's Scepter.",
      "notes": "HP drained depends on the actual damage dealt.<br />Illusions are destroyed on the first tick of damage.",
      "dmg": "",
      "attribute": "CAST RANGE: <span>800</span><br />\nMAX DURATION: <span>10</span><br/> HEALTH DRAIN PER SECOND: 150/200/250 <font size=\"3\" color=\"#6fe871\">SCEPTER DRAIN</font>180/240/300 <br/>",
      "cmb": "<img src=\"mana\"/> 125/175/225 &emsp <img src=\"cooldown\"/> 22 (<font size=\"3\" color=\"#6fe871\">0</font>)",
      "lore": "Pugna has truly become more powerful than even the grandmaster of Oblivion.",
      "image": "pugna_life_drain",
      "mainSkill": 1
    }
  ]
}