{
  "Image": "hero_clinkz",
  "Id": 56,
  "Name": "Clinkz",
  "Fraction": "Dire",
  "PrimaryAttribute": "Agility",
  "Bio": "At the base of the Bleeding Hills stretches a thousand-league wood—a place called The Hoven, where black pools gather the tarry blood of the uplands, and the king-mage Sutherex sits in benevolent rule. Once a sworn protector of the Hoven lands, Clinkz earned a reputation for his skill with a bow. In the three-hundredth year of the king-mage, the demon Maraxiform rose from sixth hell to lay claim to the forest. In response, the king-mage decreed an unbreakable spell: to any who slew the demon would be granted Life Without End.\n\nUnaware of the spell, Clinkz waded into battle, defending his lands against the demon’s fiery onslaught. Clinkz drove Maraxiform back to the gates of sixth-hell itself, where on that fiery threshold the two locked in a mortal conflict. Grievously wounded, the demon let out a blast of hellfire as Clinkz loosed his final arrow. The arrow struck the demon true as hellfire poured out across the land, lighting the black pools and burning Clinkz alive at the instant of the demon’s death. Thus, the mage’s spell took effect at the very moment of the archer’s conflagration, preserving him in this unholy state, leaving him a being of bones and rage, caught in the very act of dying, carrying hell’s breath with him on his journey into eternity.",
  "StrengthIni": 15,
  "AgilityIni": 22,
  "IntelligenceIni": 16,
  "StrengthGain": 1.9,
  "AgilityGain": 3.3,
  "IntelligenceGain": 1.55,
  "Speed": 300,
  "AttackMinIni": 15,
  "AttackMaxIni": 21,
  "DefenseIni": -1,
  "TurnRate": 0.4,
  "AttackRange": 640,
  "BAT": 1.7,
  "Abilities" : [
    {
      "id": 5259,
      "dname": "Strafe",
      "affects": "ABILITY: <span>No Target</span><br />",
      "desc": "Clinkz attacks with a barrage of arrows.  Dramatically increases attack speed for a short time.",
      "notes": "",
      "dmg": "",
      "attribute": "DURATION: <span>4 / 6 / 8 / 10</span><br/>ATTACK SPEED BONUS: 130 <br/>",
      "cmb": "<img src=\"mana\"/> 90  &emsp <img src=\"cooldown\"/> 40/35/30/25",
      "lore": "It's hard to say whether the blur around the Bone Fletcher is from his flaming heart or his speed with the quiver.",
      "image": "clinkz_strafe",
      "mainSkill": 1
    },
    {
      "id": 5260,
      "dname": "Searing Arrows",
      "affects": "ABILITY: <span>Auto-Cast, Unit Target</span><br />AFFECTS: <span>Enemy Units</span><br />DAMAGE TYPE: <span><font color=\"#71a9ea\">Physical</font></span><br />PIERCES SPELL IMMUNITY: <span><font color=\"#70EA72\">Yes</font></span><br />",
      "desc": "Imbues Clinkz's arrows with fire for extra damage.",
      "notes": "Searing Arrows deal damage to structures.<br />The damage is directly added to Clinkz' attack damage, as physical damage.",
      "dmg": "DAMAGE: 30/40/50/60<br/> ",
      "attribute": "",
      "cmb": "<img src=\"mana\" /> 10 &emsp <img src=\"cooldown\"/> 0",
      "lore": "Clinkz simply lights his arrows from his flaming essence for quite the destructive effect.",
      "image": "clinkz_searing_arrows",
      "mainSkill": 1
    },
    {
      "id": 5261,
      "dname": 	"Skeleton Walk",
      "affects": "ABILITY: <span>No Target</span><br />",
      "desc": "Clinkz moves invisibly through units until the moment he attacks or uses an ability.",
      "notes": "Will not break most channeling of spells or items upon activation.<br />Has a fadetime of 0.6 seconds.",
      "dmg": "",
      "attribute": "DURATION: <span>20 / 25 / 30 / 35</span><br />\nBONUS MOVEMENT SPEED: <span>15% / 25% / 35% / 45%</span><br/>",
      "cmb": "<img src=\"mana\" /> 75 &emsp <img src=\"cooldown\"/> 20/19/18/17",
      "lore": "With a burst of fire and puff of smoke, the Bone Fletcher was nowhere to be seen.",
      "image": "clinkz_wind_walk",
      "mainSkill": 1
    },
    {
      "id": 5262,
      "dname": "Death Pact",
      "affects": "ABILITY: <span>Unit Target</span><br />AFFECTS: <span>Units</span><br />",
      "desc": "Clinkz consumes the target friendly or enemy creep, gaining a percent of its hitpoints as max health and damage.",
      "notes": "If the target is an enemy, Clinkz will gain the correct experience and gold.<br />Increases Clinkz' current and max HP.<br />When the duration ends, max HP returns to normal, but current HP stays the same.",
      "dmg": "",
      "attribute": "DURATION: <span>65</span><br />\nHEALTH GAIN: <span>50% / 70% / 90%</span><br />\nDAMAGE GAIN: <span>5% / 7% / 9%</span><br/>",
      "cmb": "<img src=\"mana\"/> 100 &emsp <img src=\"cooldown\"/> 85",
      "lore": "Sutherex' bond of life and death has become a part of Clinkz, and his old bones are refreshed with repetition of the pact on lesser beings.",
      "image": "clinkz_death_pact",
      "mainSkill": 1
    }
  ]
}