{
  "Image": "hero_lycan",
  "Id": 77,
  "Name": "Lycanthrope",
  "Fraction": "Dire",
  "PrimaryAttribute": "Strength",
  "Bio": "Banehallow was noble-born to the house of Ambry, the greatest of the landed castes in the old kingdom of Slom. Before the Fall, as the King's wants grew strange, and his court grew crowded with sorcerers and charlatans, the house of Ambry was the first to rise against the avarice of the throne. No longer willing to pay homage and fealty, they instead sent six-thousand swords into the capital, where they were wiped out in the Massacre of the Apostates. And then came the teeth behind the old truth: When you strike a king's neck, you had better take his head. Enraged by the betrayal, the king exterminated the vast Ambry bloodline, sparing only the lord of the house and his youngest son, Banehallow. Before all the royal court, with the disgraced lord chained to the ornate marble floor, the King bade his magicians transform the boy into a wolf so that he might tear out his own father's throat. 'Do this,' the king said, 'so that Lord Ambry will understand the bite of betrayal.' Powerful magic was invoked, and the child was transformed. But though his body was changed, his spirit remained intact, and instead of biting the exposed neck of his father, he attacked his handlers, tearing them to pieces. A dozen of the King's knights perished under the wolf's teeth before they managed to drive it off into the night. Lord Ambry laughed from his chains even as the King ran him through with a sword. Now the heir to the lost house of Ambry, Banehallow wanders the trail as the Lycan, part warrior, part wolf, in search of justice for all that he lost.",
  "StrengthIni": 25,
  "AgilityIni": 16,
  "IntelligenceIni": 17,
  "StrengthGain": 3.3,
  "AgilityGain": 1,
  "IntelligenceGain": 1.55,
  "Speed": 305,
  "AttackMinIni": 36,
  "AttackMaxIni": 41,
  "DefenseIni": 1,
  "TurnRate": 0.5,
  "AttackRange": 150,
  "BAT": 1.7,
  "Abilities" : [
    {
      "id": 5395,
      "dname": "Summon Wolves",
      "affects": "ABILITY: <span >No Target</span><br />",
      "desc": "Summons two wolves to fight for Lycan.  Level 3-4 wolves have Cripple, and level 4 wolves have permanent invisibility.",
      "notes": 	"If wolves are summoned during the duration of Howl, they will receive the buff until the end of its duration.<br />Spirit Wolves have 80% magic damage resistance.<br />Using this spell will replace currently active Spirit Wolves.",
      "dmg": "",
      "attribute": "DURATION: <span >55 / 55 / 55 / 55</span><br />\nBASE ATTACK TIME: <span >1.25 / 1.2 / 1.15 / 1.1</span><br />\nDAMAGE: <span >18 / 29 / 37 / 46</span><br />\nHP: <span >200 / 240 / 280 / 320</span><br/>",
      "cmb": "<img src=\"mana\"/> 145  &emsp <img src=\"cooldown\"/> 30",
      "lore": 	"The very enchantment that twisted his being also summons canine familiars.",
      "image": "skill_5395",
      "mainSkill": 1
    },
    {
      "id": 5396,
      "dname": "Howl",
      "affects": "ABILITY: <span >No Target</span><br />",
      "desc": "Grants bonus damage and bonus health to Lycan, all allied heroes and all units under their control. Howl has double effect during night.",
      "notes": "",
      "dmg": "",
      "attribute": "DURATION: <span >13</span><br />\nHERO BONUS DAMAGE: <span >10 / 15 / 20 / 25</span><br />\nMINION BONUS DAMAGE: <span >4 / 6 / 8 / 10</span><br />\nHERO BONUS HEALTH: <span >50 / 100 / 150 / 200</span><br />\nMINION BONUS HEALTH: <span >25 / 50 / 75 / 100</span><br/>",
      "cmb": "<img src=\"mana\" /> 40 &emsp <img src=\"cooldown\"/> 60/55/50/45",
      "lore": "Blood-curdling wolf cries signal to opponents that Banehallow is among them.",
      "image": "skill_5396",
      "mainSkill": 1
    },
    {
      "id": 5397,
      "dname": "Feral Impulse",
      "affects": "ABILITY: <span >Passive</span><br />",
      "desc": "Increases the HP regeneration and damage of Lycan and all units under his control.",
      "notes": "",
      "dmg": "",
      "attribute": "RADIUS: <span >900 / 900 / 900 / 900</span><br />\nBONUS DAMAGE: <span >15% / 26% / 37% / 48%</span><br/>",
      "cmb": "",
      "lore": "His animalistic symbiosis with canine kind gives Banehallow enhanced reflexes and hunting capabilities.",
      "image": "skill_5397",
      "mainSkill": 1
    },
    {
      "id": 5398,
      "dname": "Shapeshift",
      "affects": "ABILITY: <span >No Target</span><br />",
      "desc": "Lycan assumes his lupine form, granting him and his units critical strikes and added vision at night. During Shapeshift, Lycan and all units under his control move at increased speed, cannot be slowed and have a 40% chance to deal a critical strike doing 160% damage.",
      "notes": "Hex doesn't remove Lycan's movement speed.<br />Lycan has a smaller collision size in this state.",
      "dmg": "",
      "attribute": "SHAPESHIFT MOVE SPEED: <span >650</span><br />\nBONUS NIGHT VISION: <span >1000</span><br />\nTRANSFORM TIME: <span >1.5</span><br />\nCRITICAL CHANCE: <span >40%</span><br />\nCRITICAL DAMAGE: <span >160% / 180% / 200%</span><br/>",
      "cmb": "<img src=\"mana\"/> 100 &emsp <img src=\"cooldown\"/> 120/90/60",
      "lore": 	"Forever a slave to his lycanthropy, Banehallow has come to accept his curse, and embrace his own savagery.",
      "image": "skill_5398",
      "mainSkill": 1
    }
  ]
}