{
  "Image": "hero_venomancer",
  "Id": 40,
  "Name": "Venomancer",
  "Fraction": "Dire",
  "PrimaryAttribute": "Agility",
  "Bio": "In the Acid Jungles of Jidi Isle, poison runs in the veins and bubbles in the guts of every creature that scuttles, climbs or swoops between fluorescent vines dripping with caustic sap. Yet even in this toxic menagerie, Venomancer is acknowledged as the most venomous. Ages ago, a Herbalist named Lesale crossed the Bay of Fradj by coracle, searching for potent essences that might be extracted from bark and root, and found instead a nightmare transformation. Two leagues into Jidi's jungle, Lesale encountered a reptile camouflaged as an epiphyte, which stung him as he mistakenly plucked it. In desperation, he used his partial knowledge of the jungle's herbal bounty, mixing the venom of the (swiftly throttled) reptile with the nectar of an armored orchid, to compound an antidote. In the moments before a black paralysis claimed him completely, he injected himself by orchid-thorn, and instantly fell into a coma. Seventeen years later, something stirred in the spot where he had fallen, throwing off the years' accumulation of humus: Venomancer. Lesale the Herbalist no longer—but Lesale the Deathbringer. His mind was all but erased, and his flesh had been consumed and replaced by a new type of matter—one fusing the venom of the reptile with the poisonous integument of the orchid. Jidi's Acid Jungles knew a new master, one before whom even the most vicious predators soon learned to bow or burrow for their lives. The lurid isle proved too confining, and some human hunger deep in the heart of the Venomancer drove Lesale out in search of new poisons—and new deaths to bring.",
  "StrengthIni": 18,
  "AgilityIni": 22,
  "IntelligenceIni": 17,
  "StrengthGain": 2.15,
  "AgilityGain": 2.8,
  "IntelligenceGain": 1.8,
  "Speed": 285,
  "AttackMinIni": 19,
  "AttackMaxIni": 21,
  "DefenseIni": 0,
  "TurnRate": 0.4,
  "AttackRange": 450,
  "BAT": 1.7,
  "Abilities" : [
    {
      "id": 5178,
      "dname": 	"Venomous Gale",
      "affects": "ABILITY: <span>Point Target</span><br />DAMAGE TYPE: <span>Magical</span><br />PIERCES SPELL IMMUNITY: <span>No</span><br />",
      "desc": "Launches a ball of venom in a line, poisoning enemy units so that they take both initial damage and damage over time, as well as suffering slowed movement.  Venomous Gale deals damage every 3 seconds over its duration.",
      "notes": "Units afflicted by Venomous Gale can be denied when their HP drops below 25%.<br />Duration damage is dealt every 3 seconds.<br />Slow starts at 50%, and decreases as time passes.",
      "dmg": "",
      "attribute": "DURATION: <span>15 / 15 / 15 / 15</span><br />\nINITIAL DAMAGE: <span>25 / 50 / 75 / 100</span><br />\nDAMAGE PER TICK: <span>10 / 40 / 70 / 100</span><br />\nSLOW: <span>50% / 50% / 50% / 50%</span><br/>",
      "cmb": "<img src=\"mana\"/> 125 &emsp <img src=\"cooldown\"/> 21/20/19/18",
      "lore": "A concoction of various stings, poisons, and toxins gathered from the jungles of Jidi Isle, victims surviving it are rare.",
      "image": "venomancer_venomous_gale",
      "mainSkill": 1
    },
    {
      "id": 5179,
      "dname": 	"Poison Sting",
      "affects": "ABILITY: <span>Passive</span><br />DAMAGE TYPE: <span>Magical</span><br />PIERCES SPELL IMMUNITY: <span><font color=\"#70EA72\">Yes</font></span><br />",
      "desc": "Adds poison damage to Venomancer's normal attacks, slowing movement speed.",
      "notes": "Poison Sting damage can be lethal.<br />Damage from Poison Sting does not interrupt healing from items, nor does it activate the cooldown on Blink Dagger.",
      "dmg": "",
      "attribute": "DURATION: <span>6 / 9 / 12 / 15</span><br />\nDAMAGE PER SECOND: <span>6 / 14 / 22 / 30</span><br />\nSLOW: <span>11% / 12% / 13% / 14%</span><br/>",
      "cmb": "",
      "lore": "The paralytic sting of the creature which caused his transformation now belongs to the Venomancer.",
      "image": "venomancer_poison_sting",
      "mainSkill": 1
    },
    {
      "id": 5180,
      "dname": "Plague Ward",
      "affects": "ABILITY: <span>Point Target</span><br />DAMAGE TYPE: <span><font color=\"#71a9ea\">Physical</font></span><br />PIERCES SPELL IMMUNITY: <span><font color=\"#70EA72\">Yes</font></span><br />",
      "desc": "Summons a plague ward to attack enemy units and structures. The ward is immune to magic. Wards gain the Poison Sting level from Venomancer, dealing 50% of the full damage.",
      "notes": "",
      "dmg": "",
      "attribute": "DURATION: <span>40</span><br />\nWARD HP: <span>75 / 200 / 325 / 450</span><br />\nWARD DAMAGE: <span>13 / 22 / 31 / 40</span><br/>",
      "cmb": "<img src=\"mana\"/> 20 &emsp <img src=\"cooldown\"/> 5",
      "lore": "A mixture of his old herbalist talents and newfound toxic mastery creates a living embodiment of plague.",
      "image": "venomancer_plague_ward",
      "mainSkill": 1
    },
    {
      "id": 5181,
      "dname": "Poison Nova",
      "affects": "ABILITY: <span>No Target</span><br />DAMAGE TYPE: <span>Magical</span><br />PIERCES SPELL IMMUNITY: <span><font color=\"#70EA72\">Yes</font></span><br />",
      "desc": "A spreading ring of poison that does damage over time to enemy units around Venomancer.  Poison Nova cannot deal lethal damage; targets will be left with at least 1 health.\nnUpgradable by Aghanim's Scepter.",
      "notes": "",
      "dmg": "",
      "attribute": "RADIUS: <span>830</span><br />\nDURATION: <span>16</span><br />\nDAMAGE: <span>30 / 55 / 80</span><br />\n<font size=\"3\" color=\"#6fe871\">SCEPTER COOLDOWN:</font> <span>140 / 120 / 60</span><br />\n<font size=\"3\" color=\"#6fe871\">SCEPTER DAMAGE:</font> <span>60 / 85 / 110</span><br/>",
      "cmb": "<img src=\"mana\"/> 200/300/400 &emsp <img src=\"cooldown\"/> 60 / 85 / 110",
      "lore": "In the Acid Jungles, creatures releasing noxious poison to their attackers is common; Venomancer spreads this plague beyond the Jidi Isle.",
      "image": "venomancer_poison_nova",
      "mainSkill": 1
    }
  ]
}