{
  "Image": "hero_furion",
  "Id": 53,
  "Name": "Nature's Prophet",
  "Fraction": "Radiant",
  "PrimaryAttribute": "Intelligence",
  "Bio": "When Verodicia, Goddess of the Woods, had finished filling in the green places, having planted the coiled-up spirit in the seed, having lured the twining waters from deep within the rock, having sworn the sun its full attention to the growing things, she realized that her own time had reached its end, and like one of the leaves whose fate she had imprinted in the seed, she would fall without seeing the fruiting of her dream. It pained her to leave the world bereft, for the sprouts had not yet broken through the soil--and they would be tender and vulnerable to every sort of harm. She found in her seed pouch one last seed that she had missed in the sowing. She spoke a single word into the seed and swallowed it as she fell. Her vast body decomposed throughout the long winter, becoming the humus that would feed the seedlings in the spring. And on the morning of the vernal equinox, before the rest of the forest had begun to wake, that last seed ripened and burst in an instant. From it stepped Nature's Prophet, in full leaf, strong and wise, possessing Verodicia's power to foresee where he would be needed most in defense of the green places--and any who might be fortunate enough to call him an ally.",
  "StrengthIni": 19,
  "AgilityIni": 18,
  "IntelligenceIni": 25,
  "StrengthGain": 2.1,
  "AgilityGain": 1.9,
  "IntelligenceGain": 2.9,
  "Speed": 295,
  "AttackMinIni": 30,
  "AttackMaxIni": 44,
  "DefenseIni": 1,
  "TurnRate": 0.6,
  "AttackRange": 600,
  "BAT": 1.7,
  "Abilities" : [
    {
      "id": 5245,
      "dname": 	"Sprout",
      "affects": "ABILITY: <span>Unit Target, Point Target</span><br />AFFECTS: <span>Heroes</span><br />",
      "desc": "Sprouts a ring of trees around a unit, trapping it in place.",
      "notes": "Sprout can be cast on any unit, or the ground.<br />Trees created by Sprout have the same interactions with abilities as regular trees.",
      "dmg": "",
      "attribute": "DURATION: <span>3 / 4 / 5 / 6</span><br />\nCAST RANGE: <span>625 / 700 / 775 / 850</span><br/>",
      "cmb": "<img src=\"mana\"/> 70/90/110/130  &emsp <img src=\"cooldown\"/> 11/10/9/8",
      "lore": "Verdant overgrowth is a common ailment reported by Nature's Prophet's attackers.",
      "image": "skill_5245",
      "mainSkill": 1
    },
    {
      "id": 5246,
      "dname": "Teleportation",
      "affects": "ABILITY: <span>Point Target</span><br />",
      "desc": "Teleports to any point on the map.",
      "notes": "Teleport takes 3 seconds to cast.<br />Mana and cooldown take effect when the cast is completed.  Nature's Prophet will not use any mana or waste the cooldown if the spell is interrupted while casting.<br />When the cast begins, an effect is created at the target location, which is visible to allies and enemies.",
      "dmg": "",
      "attribute": "",
      "cmb": "<img src=\"mana\" /> 50 &emsp <img src=\"cooldown\"/> 50/40/30/20",
      "lore": "The Prophet keeps his sentinel over the forest, protecting it when in need.",
      "image": "skill_5246",
      "mainSkill": 1
    },
    {
      "id": 5247,
      "dname": "Nature's Call",
      "affects": "ABILITY: <span>Point Target</span><br />",
      "desc": "Converts an area of trees into Treants. Treants have 550 health and deal 30-34 damage.",
      "notes": "Nature's Call can only create as many treants as there are trees in the target area.",
      "dmg": "",
      "attribute": "TREANT COUNT: <span>2 / 3 / 4 / 5</span><br />\nTREANT DURATION: <span>60 / 60 / 60 / 60</span><br/>",
      "cmb": "<img src=\"mana\" /> 130/140/150/160 &emsp <img src=\"cooldown\"/> 37",
      "lore": "Verodicia bestowed the Prophet with the ability to summon the Treant Guard, a mythical sentient army of the wild.",
      "image": "skill_5247",
      "mainSkill": 1
    },
    {
      "id": 5248,
      "dname":"Wrath of Nature",
      "affects": "ABILITY: <span>Unit Target, Point Target</span><br />AFFECTS: <span>Enemy Units</span><br />DAMAGE TYPE: <span>Magical</span><br />PIERCES SPELL IMMUNITY: <span><font color=\"#70EA72\">Yes</font></span><br />",
      "desc": "Damaging energy bounces around the map, striking enemies close to the cast point that are in vision. Each enemy hit beyond the first adds damage.\nUpgradable by Aghanim's Scepter.",
      "notes": "Wrath of Nature will not hit units out of vision.<br />Can be cast through the minimap; the nearest valid target will be selected.",
      "dmg": "",
      "attribute": "MAX TARGETS: <span>16 / 16 / 16</span><br />\nDAMAGE: <span>110 / 140 / 170</span><br />\nADDED DAMAGE PER BOUNCE: <span>11%</span><br />\n<font size=\"3\" color=\"#6fe871\">SCEPTER DAMAGE:</font> <span>135 / 170 / 205</span><br />\n<font size=\"3\" color=\"#6fe871\">SCEPTER TREANT SPAWN TIMER:</font> <span>4</span><br/>",
      "cmb": "<img src=\"mana\"/> 175/225/275 &emsp <img src=\"cooldown\"/>  90/75/60",
      "lore": "Nature's Prophet calls Verodicia's fury to strike down those who might ravage the wilderness.",
      "image": "skill_5248",
      "mainSkill": 1
    }
  ]
}