{
  "Image": "hero_bounty_hunter",
  "Id": 62,
  "Name": "Bounty Hunter",
  "Fraction": "Radiant",
  "PrimaryAttribute": "Agility",
  "Bio": "When the hunted tell tales of Gondar the Bounty Hunter, none are sure of which are true. In whispered tones they say he was abandoned as a kit, learning his skill in tracking as a matter of simple survival. Others hear he was an orphan of war, taken in by the great Soruq the Hunter to learn the master’s skill with a blade as they plumbed the dark forests for big game. Still others believe he was a lowly street urchin raised among a guild of cutpurses and thieves, trained in the arts of stealth and misdirection. Around campfires in the wild countryside his quarry speaks the rumors of Gondar’s work, growing ever more fearful: they say it was he who tracked down the tyrant King Goff years after the mad regent went into hiding, delivering his head and scepter as proof. That it was he who infiltrated the rebel camps at Highseat, finally bringing the legendary thief White Cape to be judged for his crimes. And that it was he who ended the career of Soruq the Hunter, condemned as a criminal for killing the Prince’s prized hellkite. The tales of Gondar’s incredible skill stretch on, with each daring feat more unbelievable than the last, each target more elusive. For the right price, the hunted know, anyone can be found. For the right price, even the mightiest may find fear in the shadows.",
  "StrengthIni": 17,
  "AgilityIni": 21,
  "IntelligenceIni": 19,
  "StrengthGain": 2.1,
  "AgilityGain": 3,
  "IntelligenceGain": 2,
  "Speed": 320,
  "AttackMinIni": 24,
  "AttackMaxIni": 38,
  "DefenseIni": 3,
  "TurnRate": 0.6,
  "AttackRange": 150,
  "BAT": 1.7,
  "Abilities" : [
    {
      "id": 5285,
      "dname": "Shuriken Toss",
      "affects": "ABILITY: <span >Unit Target</span><br />AFFECTS: <span >Enemy Units</span><br />DAMAGE TYPE: <span >Magical</span><br />PIERCES SPELL IMMUNITY: <span >No</span><br />",
      "desc": "Hurls a deadly shuriken at an enemy unit, dealing damage and mini-stunning the target.  The shuriken will bounce between any Tracked units who are within a 1200 radius of each other.\nUpgradable by Aghanim's Scepter.",
      "notes": "This spell interrupts channeling abilities.",
      "dmg": "DAMAGE: <span>150 /225 /300 /375</span><br />",
      "attribute": "TRACK BOUNCE RANGE: <span >1200</span><br/>",
      "cmb": "<img src=\"mana\"/> 120/130/140/150  &emsp <img src=\"cooldown\"/> 10",
      "lore": "While the shuriken may be small, Gondar's precise aim can cause critical damage.",
      "image": "skill_5285",
      "mainSkill": 1
    },
    {
      "id": 5286,
      "dname": "Jinada",
      "affects": "ABILITY: <span >Passive</span><br />",
      "desc": "Bounty Hunter plans his next hit, passively adding a critical strike and maim to his next attack.",
      "notes": "",
      "dmg": "",
      "attribute": "CRITICAL DAMAGE: <span >150% / 175% / 200% / 225%</span><br />\nMOVE SLOW: <span >15% / 20% / 25% / 30%</span><br />\nATTACK SLOW: <span >15 / 20 / 25 / 30</span><br />\nDURATION: <span >3 / 3 / 3 / 3</span><br/>",
      "cmb": "<img src=\"cooldown\"/> 12/10/8/6",
      "lore": "Whispering an enchantment he learned from Soruq to his faithful blades, Gondar targets vital tendons and joints to disable his opponents.",
      "image": "skill_5286",
      "mainSkill": 1
    },
    {
      "id": 5287,
      "dname": "Shadow Walk",
      "affects": "ABILITY: <span >No Target</span><br />DAMAGE TYPE: <span ><font color=\"#71a9ea\">Physical</font></span><br />PIERCES SPELL IMMUNITY: <span ><font color=\"#70EA72\">Yes</font></span><br />",
      "desc": "Bounty Hunter becomes invisible and gains the ability to move through other units until he attacks or uses an ability.  If he breaks the invisibility with an attack, that attack will deal bonus damage.",
      "notes": "Will not break most channeling of spells upon activation.<br />The bonus damage is a separate instance, and isn't considered in Jinada's calculation.",
      "dmg": "",
      "attribute": "DURATION: <span >20 / 25 / 30 / 35</span><br />\nFADE TIME: <span >1 / 0.75 / 0.5 / 0.25</span><br />\nBONUS DAMAGE: <span >30 / 60 / 90 / 120</span><br/>",
      "cmb": "<img src=\"mana\"/> 65 &emsp <img src=\"cooldown\"/> 15",
      "lore": "The court jesters present during King Goff's assassination can recount no other image than a dancing shadow.",
      "image": "skill_5287",
      "mainSkill": 1
    },
    {
      "id": 5288,
      "dname": "Track",
      "affects": "ABILITY: <span >Unit Target</span><br />AFFECTS: <span >Enemy Heroes</span><br />PIERCES SPELL IMMUNITY: <span ><font color=\"#70EA72\">Yes</font></span><br />",
      "desc": "Tracks an enemy hero, granting True Sight of the target, and information on how much gold it is carrying. Allies near the hunted are granted bonus movement speed. If the target dies, Bounty Hunter and nearby heroes collect a bonus bounty of gold.",
      "notes": "Bounty Hunter will get the bonus gold if the target dies while Track is active, regardless of how it died.<br />Track's effect is only visible to allies.<br />The allies that are receiving the bonus speed from Track are the ones that will receive the bonus gold.<br />Bonus gold is reliable gold.",
      "dmg": "",
      "attribute": "SPEED RADIUS: <span >900 / 900 / 900</span><br />\nBONUS SPEED: <span >16% / 18% / 20%</span><br />\nBONUS GOLD FOR SELF: <span >150 / 250 / 350</span><br />\nBONUS GOLD FOR ALLIES: <span >40 / 80 / 120</span><br />\nDURATION: <span >30 / 30 / 30</span><br />\nCAST RANGE: <span >1200</span><br/>",
      "cmb": "<img src=\"mana\"/> 65 &emsp <img src=\"cooldown\"/> 4",
      "lore": "Using his elevated senses of sight and smell, Gondar's hits have quite a good chance of success.",
      "image": "skill_5288",
      "mainSkill": 1
    }
  ]
}