{
  "Image": "hero_dragon_knight",
  "Id": 49,
  "Name": "Dragon Knight",
  "Fraction": "Radiant",
  "PrimaryAttribute": "Strength",
  "Bio": "After years on the trail of a legendary Eldwurm, the skilled dragon-slayer found himself facing a disappointing foe: the dreaded Slyrak had grown ancient and frail, its wings tattered, its few remaining scales stricken with scale-rot, its fangs ground to nubs, and its fire-gouts no more threatening than a pack of wet matchsticks. Seeing no honor to be gained in dragon-murder, the young knight prepared to turn away and leave his old foe to die in peace. But a voice crept into his thoughts, and Slyrak gave a whispered plea that the knight might honor him with death in combat. The knight agreed, and found himself rewarded beyond expectation for his act of mercy: As he sank his blade in Slyrak's breast, the dragon sank a claw into his throat. As their blood mingled, Slyrak sent his power out along the Blood Route, offering all its strength and centuries of wisdom to the knight. The dragon's death sealed their bond, and Dragon Knight was born. The ancient power slumbers in the knight, waking when he calls it; or perhaps it is the Dragon that calls the Knight.",
  "StrengthIni": 19,
  "AgilityIni": 2.2,
  "IntelligenceIni": 15,
  "StrengthGain": 3.1,
  "AgilityGain": 2.2,
  "IntelligenceGain": 1.7,
  "Speed": 290,
  "AttackMinIni": 31,
  "AttackMaxIni": 37,
  "DefenseIni": 1,
  "TurnRate": 0.6,
  "AttackRange": 150,
  "BAT": 1.7,
  "Abilities" : [
    {
      "id": 5226,
      "dname": "Breathe Fire",
      "affects": "ABILITY: <span >Unit Target, Point Target</span><br />AFFECTS: <span >Enemy Units</span><br />DAMAGE TYPE: <span >Magical</span><br />PIERCES SPELL IMMUNITY: <span >No</span><br />",
      "desc": "Unleashes a breath of fire in front of Dragon Knight that burns enemies and reduces the damage their attacks deal.",
      "notes": "Affects mechanical units.<br />Hits units up to 900 away.",
      "dmg": "DAMAGE: <span >90 / 170 / 240 / 300</span><br />",
      "attribute": "DAMAGE REDUCTION: <span >35%</span><br />\nREDUCTION DURATION: <span >11</span><br />",
      "cmb": 	"<img src=\"mana\" /> 100/110/120/130 &emsp <img src=\"cooldown\" /> 14/13/12/11",
      "lore": "Knight Davion's breath has become that of the mighty Eldwurm Slyrak, remembered for burning numerous other knights to a crisp.",
      "image": "skill_5226",
      "mainSkill": 1
    },
    {
      "id": 5227,
      "dname": "Dragon Tail",
      "affects": "ABILITY: <span >Unit Target</span><br />AFFECTS: <span >Enemy Units</span><br />DAMAGE TYPE: <span >Magical</span><br />PIERCES SPELL IMMUNITY: <span >No</span><br />",
      "desc": "Dragon Knight smites an enemy unit in melee range with his shield, stunning it while dealing minor damage.  When in Elder Dragon Form, the cast range increases to 400.",
      "notes": "",
      "dmg": "DAMAGE: <span >25 / 50 / 75 / 100</span><br />",
      "attribute": "STUN DURATION: <span >2.5 / 2.75 / 3 / 3.25</span><br/>",
      "cmb": "<img src=\"mana\" /> 100 &emsp <img src=\"cooldown\" /> 12/11/10/9",
      "lore": "Davion's combination of dragon talents and knightly skills makes him a vicious opponent in melee combat.",
      "image": "skill_5227",
      "mainSkill": 1
    },
    {
      "id": 5228,
      "dname": "Dragon Blood",
      "affects": "ABILITY: <span >Passive</span><br />",
      "desc": "The life blood of the Dragon improves health regeneration and strengthens armor.",
      "notes": "",
      "dmg": "",
      "attribute": "Health Regen Bonus: 3/6/9/12 <br/> Armor Bonus: 3/6/9/12 <br />",
      "cmb": "",
      "lore": "Slyrak's blood still courses through Davion's veins, giving him twice the vitality of an ordinary knight.",
      "image": "skill_5228",
      "mainSkill": 1
    },
    {
      "id": 5229,
      "dname": "Elder Dragon Form",
      "affects": "ABILITY: <span >No Target</span><br />PIERCES SPELL IMMUNITY: <span ><font color=\"#70EA72\">Yes</font></span><br />",
      "desc": "Dragon Knight takes the form of one of three powerful elder dragons, increasing his speed, and Dragon Tail's range, while granting him new powers.\r\n<font color=\"#9acd32\">LEVEL 1 Green Dragon</font> - Corrosive Breath: attacks deal 20 poison damage per second for 5 seconds. Works on structures.\r\n<font color=\"#ff0000\">LEVEL 2 Red Dragon</font> - Splash Attack: attacks damage all enemy units in a 300 radius, with Corrosive Breath added to the targets.\r\n<font color=\"#87ceeb\">LEVEL 3 Blue Dragon</font> - Frost Breath: slows movement speed by 30% and attack speed by 30 of enemy units in Splash Attack range for 3 seconds, with Corrosive Breath added to the targets.",
      "notes": "Corrosive Breath poison damage is lethal.<br />Splash Attack deals 100/75/50% damage in a 150/225/300 radius. Splash damage does not affect buildings.<br />Frost Breath stacks with Unique Attack Modifiers.<br />Manta Style's cooldown time will be based on whether Dragon Knight was in his ranged or melee form when the item was used.",
      "dmg": "",
      "attribute": "DURATION: <span >60</span><br />\nBONUS MOVE SPEED: <span >25 / 25 / 25</span><br />\nBONUS ATTACK RANGE: <span >350</span><br/>",
      "cmb": "<img src=\"mana\" /> 50 &emsp <img src=\"cooldown\" /> 115",
      "lore": "The dormant dragon power springs forth from within Davion, combining the powers of a legendary knight with a legendary Eldwurm.",
      "image": "skill_5229",
      "mainSkill": 1
    }
  ]
}